Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/*=============================================================================
 *
 * Project: a2bstack
 *
 * Copyright (c) 2015 - Analog Devices Inc. All Rights Reserved.
 * This software is subject to the terms and conditions of the license set 
 * forth in the project LICENSE file. Downloading, reproducing, distributing or 
 * otherwise using the software constitutes acceptance of the license. The 
 * software may not be used except as expressly authorized under the license.
 *
 *=============================================================================
 *
 * \file:   regdefs.h
 * \author: Mentor Graphics, Embedded Software Division
 * \brief:  Provides AD2410 register definitions and masks.
 *
 *=============================================================================
 */

/*============================================================================*/
/** 
 * \defgroup a2bstack_regdefs           Register Definitions
 *  
 * Provides AD2410 register definitions and masks.
 *
 * \{ */
/*============================================================================*/

#ifndef A2B_REGDEFS_H_
#define A2B_REGDEFS_H_

/*======================= I N C L U D E S =========================*/

/*======================= D E F I N E S ===========================*/

/*----------------------------------------------------------------------------*/
/** 
 * \defgroup a2bstack_regdefs_offsets       Register Offsets
 *  
 * These are the register offset values.
 *
 * \{ */
/*----------------------------------------------------------------------------*/

/* ============================================================================================================================ */
/** \name   A2B Register Address Definitions */
/* ============================================================================================================================ */
#define A2B_MOD_BASE                        (0x00000000u)             /*!<  A2B Base Offset */
#define A2B_MOD_MASK                        (0x00000FFFu)             /*!<  A2B Offset Mask */
#define A2B_REG_PINCFG                      (0x00000052u)             /*!<  A2B Pin Configuration Register */
/* ============================================================================================================================ */
/** \name   A2B Analog Tuning Register Definitions */
/** \note   Private undocumented internal registers. Not to be modified by the user */
/* ============================================================================================================================ */
#define A2B_REG_VREGCTL                     (0x0000002Du)             /*!<  A2B Voltage Regulator Control Register */
#define A2B_REG_TXACTL                      (0x0000002Eu)             /*!<  A2B LVDSA TX Control Register */
#define A2B_REG_RXACTL                      (0x0000002Fu)             /*!<  A2B LVDSA RX Control Register */
#define A2B_REG_TXBCTL                      (0x00000030u)             /*!<  A2B LVDSB TX Control Register */
#define A2B_REG_RXBCTL                      (0x00000031u)             /*!<  A2B LVDSB RX Control Register */
/* ============================================================================================================================ */
/** \name   A2B Config, Master Only, Auto-Broadcast, Shadowed Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_SLOTFMT                     (0x00000010u)             /*!<  A2B Slot Format Register (Master Only, Auto-Broadcast) */
#define A2B_REG_DATCTL                      (0x00000011u)             /*!<  A2B Data Control Register (Master Only, Auto-Broadcast) */
/* ============================================================================================================================ */
/** \name   A2B Config, Shadowed Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_DNSLOTS                     (0x0000000Du)             /*!<  A2B Downstream Slots Register */
#define A2B_REG_UPSLOTS                     (0x0000000Eu)             /*!<  A2B Upstream Slots Register */
#define A2B_REG_RESPCYCS                    (0x0000000Fu)             /*!<  A2B Response Cycles Register */
/* ============================================================================================================================ */
/** \name   A2B Config, Shadowed, Slave Only Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_BCDNSLOTS                   (0x0000000Au)             /*!<  A2B Broadcast Downstream Slots Register (Slave Only) */
#define A2B_REG_LDNSLOTS                    (0x0000000Bu)             /*!<  A2B Local Downstream Slots Register (Slave Only) */
#define A2B_REG_LUPSLOTS                    (0x0000000Cu)             /*!<  A2B Local Upstream Slots Register (Slave Only) */
/* ============================================================================================================================ */
/** \name   A2B Configuration Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_SWCTL                       (0x00000009u)             /*!<  A2B Switch Control Register */
/* ============================================================================================================================ */
/** \name   A2B Control Master Only Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_NODEADR                     (0x00000001u)             /*!<  A2B Node Address Register (Master only) */
/* ============================================================================================================================ */
/** \name   A2B Control, Master Only Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_CONTROL                     (0x00000012u)             /*!<  A2B Control Register (Master Only) */
/* ============================================================================================================================ */
/** \name   A2B Start Discovery, Master Only Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_DISCVRY                     (0x00000013u)             /*!<  A2B Discovery Register (Master Only) */
/* ============================================================================================================================ */
/** \name   A2B Status Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_NODE                        (0x00000029u)             /*!<  A2B Node Register */
#define A2B_REG_TRANSTAT                    (0x0000002Au)             /*!<  A2B Transfer Status Register (Master Only) - Undocumented */
#define A2B_REG_DISCSTAT                    (0x0000002Bu)             /*!<  A2B Discovery Status Register (Master Only) */
#define A2B_REG_NSCURCNT                    (0x0000002Cu)             /*!<  A2B New Structure Current Count Register - Undocumented */
/* ============================================================================================================================ */
/** \name   A2B Status Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_SWSTAT                      (0x00000014u)             /*!<  A2B Switch Status Register */
/* ============================================================================================================================ */
/** \name   E-Fuse Register Definitions */
/** \note   Private undocumented internal registers. Not to be modified by the user */
/* ============================================================================================================================ */
#define A2B_REG_EFUSEADDR                   (0x000000F0u)             /*!<  A2B EFuse Address Register */
#define A2B_REG_EFUSERDAT                   (0x000000F1u)             /*!<  A2B EFuse Read Data Register */
#define A2B_REG_EFUSEWDAT                   (0x000000F2u)             /*!<  A2B EFuse Write Data Register */
/* ============================================================================================================================ */
/** \name   I2C Control Slave Only Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_CHIP                        (0x00000000u)             /*!<  A2B I2C Chip Address Register (Slave Only) */
/* ============================================================================================================================ */
/** \name   I2C, I2S, and PDM Control and Configuration Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_I2CCFG                      (0x0000003Fu)             /*!<  A2B I2C Configuration Register */
#define A2B_REG_PLLCTL                      (0x00000040u)             /*!<  A2B PLL Control Register - Undocumented */
#define A2B_REG_I2SGCFG                     (0x00000041u)             /*!<  A2B I2S Global Configuration Register */
#define A2B_REG_I2SCFG                      (0x00000042u)             /*!<  A2B I2S Configuration Register */
#define A2B_REG_I2SRATE                     (0x00000043u)             /*!<  A2B I2S Rate Register (Slave Only) */
#define A2B_REG_I2STXOFFSET                 (0x00000044u)             /*!<  A2B I2S Transmit Data Offset Register */
#define A2B_REG_I2SRXOFFSET                 (0x00000045u)             /*!<  A2B I2S Receive Data Offset Register */
#define A2B_REG_SYNCOFFSET                  (0x00000046u)             /*!<  A2B SYNC Offset Register (Slave Only) */
#define A2B_REG_PDMCTL                      (0x00000047u)             /*!<  A2B PDM Control Register */
#define A2B_REG_ERRMGMT                     (0x00000048u)             /*!<  A2B Error Management Register */
#define A2B_REG_I2STEST                     (0x00000053u)             /*!<  A2B I2S Test Register */
#define A2B_REG_I2SRRATE                    (0x00000056u)             /*!<  A2B I2S Reduced Rate Register (Master only, Auto-Broadcast) - AD242X only */
#define A2B_REG_I2SRRCTL                    (0x00000057u)             /*!<  A2B I2S Reduced Rate Control Register - AD242X only */
#define A2B_REG_I2SRRSOFFS                  (0x00000058u)             /*!<  A2B I2S Reduced Rate SYNC Offset Register (Slave only) - AD242X only */

/* ============================================================================================================================ */
/** \name   ID Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_VENDOR                      (0x00000002u)             /*!<  A2B Vendor ID Register */
#define A2B_REG_PRODUCT                     (0x00000003u)             /*!<  A2B Product ID Register */
#define A2B_REG_VERSION                     (0x00000004u)             /*!<  A2B Version ID Register */
#define A2B_REG_CAPABILITY                  (0x00000005u)             /*!<  A2B Capability ID Register */
/* ============================================================================================================================ */
/** \name   Interrupt and Error Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_INTSTAT                     (0x00000015u)             /*!<  A2B Interrupt Status Register */
#define A2B_REG_INTSRC                      (0x00000016u)             /*!<  A2B Interrupt Source Register (Master Only) */
#define A2B_REG_INTTYPE                     (0x00000017u)             /*!<  A2B Interrupt Type Register (Master Only) */
#define A2B_REG_INTPND0                     (0x00000018u)             /*!<  A2B Interrupt Pending 0 Register */
#define A2B_REG_INTPND1                     (0x00000019u)             /*!<  A2B Interrupt Pending 1 Register */
#define A2B_REG_INTPND2                     (0x0000001Au)             /*!<  A2B Interrupt Pending 2 Register (Master Only) */
#define A2B_REG_INTMSK0                     (0x0000001Bu)             /*!<  A2B Interrupt Mask 0 Register */
#define A2B_REG_INTMSK1                     (0x0000001Cu)             /*!<  A2B Interrupt Mask 1 Register */
#define A2B_REG_INTMSK2                     (0x0000001Du)             /*!<  A2B Interrupt Mask 2 Register (Master Only) */
#define A2B_REG_BECCTL                      (0x0000001Eu)             /*!<  A2B Bit Error Count Control Register */
#define A2B_REG_BECNT                       (0x0000001Fu)             /*!<  A2B Bit Error Count Register */
#define A2B_REG_RAISE                       (0x00000054u)             /*!<  A2B Raise Interrupt Register */
#define A2B_REG_GENERR                      (0x00000055u)             /*!<  A2B Generate Bus Error */
/* ============================================================================================================================ */
/** \name   PRBS Test Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_TESTMODE                    (0x00000020u)             /*!<  A2B Testmode Register */
#define A2B_REG_ERRCNT0                     (0x00000021u)             /*!<  A2B PRBS Error Count Byte 0 Register */
#define A2B_REG_ERRCNT1                     (0x00000022u)             /*!<  A2B PRBS Error Count Byte 1 Register */
#define A2B_REG_ERRCNT2                     (0x00000023u)             /*!<  A2B PRBS Error Count Byte 2 Register */
#define A2B_REG_ERRCNT3                     (0x00000024u)             /*!<  A2B PRBS Error Count Byte 3 Register */
#define A2B_REG_SEED0                       (0x00000025u)             /*!<  A2B PRBS Seed Byte 0 Register - Undocumented */
#define A2B_REG_SEED1                       (0x00000026u)             /*!<  A2B PRBS Seed Byte 1 Register - Undocumented */
#define A2B_REG_SEED2                       (0x00000027u)             /*!<  A2B PRBS Seed Byte 2 Register - Undocumented */
#define A2B_REG_SEED3                       (0x00000028u)             /*!<  A2B PRBS Seed Byte 3 Register - Undocumented */
/* ============================================================================================================================ */
/** \name   Pin IO and Interrupt Register Definitions */
/* ============================================================================================================================ */
#define A2B_REG_CLKCFG                      (0x00000049u)             /*!<  A2B Clock Config Register - Undocumented */
#define A2B_REG_GPIODAT                     (0x0000004Au)             /*!<  A2B GPIO Output Data Register */
#define A2B_REG_GPIODATSET                  (0x0000004Bu)             /*!<  A2B GPIO Output Data Set Register */
#define A2B_REG_GPIODATCLR                  (0x0000004Cu)             /*!<  A2B GPIO Output Data Clear Register */
#define A2B_REG_GPIOOEN                     (0x0000004Du)             /*!<  A2B GPIO Output Enable Register */
#define A2B_REG_GPIOIEN                     (0x0000004Eu)             /*!<  A2B GPIO Input Enable Register */
#define A2B_REG_GPIOIN                      (0x0000004Fu)             /*!<  A2B GPIO Input Value Register */
#define A2B_REG_PINTEN                      (0x00000050u)             /*!<  A2B Pin Interrupt Enable Register */
#define A2B_REG_PINTINV                     (0x00000051u)             /*!<  A2B Pin Interrupt Invert Register */
#define A2B_REG_CLK1CFG                     (0x00000059u)             /*!<  A2B CLKOUT1 Configuration Register - AD242X only */
#define A2B_REG_CLK2CFG                     (0x0000005Au)             /*!<  A2B CLKOUT2 Configuration Register - AD242X only */
/* ============================================================================================================================ */
/** \name   Bus Monitor Register Definitions - AD242X only */
/* ============================================================================================================================ */
#define A2B_REG_BMMCFG                      (0x0000005Bu)             /*!<  A2B Bus Monitor Mode Configuration Register - AD242X only */
/* ============================================================================================================================ */
/** \name   Sustain Register Definitions - AD242X only */
/* ============================================================================================================================ */
#define A2B_REG_SUSCFG                      (0x0000005Cu)             /*!<  A2B Sustain Configuration Register (Slave only) - AD242X only */
/* ============================================================================================================================ */
/** \name   Slave-to-Slave Routing Register Definitions - AD242X only */
/* ============================================================================================================================ */
#define A2B_REG_UPMASK0                     (0x00000060u)            /*!<  A2B Upstream Data RX Mask 0 (Slave only) - AD242X only */
#define A2B_REG_UPMASK1                     (0x00000061u)            /*!<  A2B Upstream Data RX Mask 1 (Slave only) - AD242X only */
#define A2B_REG_UPMASK2                     (0x00000062u)            /*!<  A2B Upstream Data RX Mask 2 (Slave only) - AD242X only */
#define A2B_REG_UPMASK3                     (0x00000063u)            /*!<  A2B Upstream Data RX Mask 3 (Slave only) - AD242X only */
#define A2B_REG_UPOFFSET                    (0x00000064u)            /*!<  A2B Local Upstream Slots Offset Register (Slave only) - AD242X only */
#define A2B_REG_DNMASK0                     (0x00000065u)            /*!<  A2B Downstream Data RX Mask 0 (Slave only) - AD242X only */
#define A2B_REG_DNMASK1                     (0x00000066u)            /*!<  A2B Downstream Data RX Mask 1 (Slave only) - AD242X only */
#define A2B_REG_DNMASK2                     (0x00000067u)            /*!<  A2B Downstream Data RX Mask 2 (Slave only) - AD242X only */
#define A2B_REG_DNMASK3                     (0x00000068u)            /*!<  A2B Downstream Data RX Mask 3 (Slave only) - AD242X only */
#define A2B_REG_DNOFFSET                    (0x00000069u)            /*!<  A2B Local Downstream Slots Offset Register (Slave only) - AD242X only */
/* ============================================================================================================================ */
/** \name   GPIO Over Distance Register Definitions - AD242X only */
/* ============================================================================================================================ */
#define A2B_REG_GPIODEN                     (0x00000080u)            /*!<  A2B GPIO Over Distance Enable - AD242X only */
#define A2B_REG_GPIOD0MSK                   (0x00000081u)            /*!<  A2B GPIO Over Distance Mask 0 Register - AD242X only */
#define A2B_REG_GPIOD1MSK                   (0x00000082u)            /*!<  A2B GPIO Over Distance Mask 1 Register - AD242X only */
#define A2B_REG_GPIOD2MSK                   (0x00000083u)            /*!<  A2B GPIO Over Distance Mask 2 Register - AD242X only */
#define A2B_REG_GPIOD3MSK                   (0x00000084u)            /*!<  A2B GPIO Over Distance Mask 3 Register - AD242X only */
#define A2B_REG_GPIOD4MSK                   (0x00000085u)            /*!<  A2B GPIO Over Distance Mask 4 Register - AD242X only */
#define A2B_REG_GPIOD5MSK                   (0x00000086u)            /*!<  A2B GPIO Over Distance Mask 5 Register - AD242X only */
#define A2B_REG_GPIOD6MSK                   (0x00000087u)            /*!<  A2B GPIO Over Distance Mask 6 Register - AD242X only */
#define A2B_REG_GPIOD7MSK                   (0x00000088u)            /*!<  A2B GPIO Over Distance Mask 7 Register - AD242X only */
#define A2B_REG_GPIODDAT                    (0x00000089u)            /*!<  A2B GPIO Over Distance Data Register - AD242X only */
#define A2B_REG_GPIODINV                    (0x0000008Au)            /*!<  A2B GPIO Over Distance Invert Register - AD242X only */
/* ============================================================================================================================ */
/** \name   Mailbox Register Definitions (Slave only) - AD242X only */
/* ============================================================================================================================ */
#define A2B_REG_MBOX0CTL                    (0x00000090u)            /*!<  A2B Mailbox 0 Control Register (Slave only) - AD242X only */
#define A2B_REG_MBOX0STAT                   (0x00000091u)            /*!<  A2B Mailbox 0 Status Register (Slave only) - AD242X only */
#define A2B_REG_MBOX0B0                     (0x00000092u)            /*!<  A2B Mailbox 0 Byte 0 Register (Slave only) - AD242X only */
#define A2B_REG_MBOX0B1                     (0x00000093u)            /*!<  A2B Mailbox 0 Byte 1 Register (Slave only) - AD242X only */
#define A2B_REG_MBOX0B2                     (0x00000094u)            /*!<  A2B Mailbox 0 Byte 2 Register (Slave only) - AD242X only */
#define A2B_REG_MBOX0B3                     (0x00000095u)            /*!<  A2B Mailbox 0 Byte 3 Register (Slave only) - AD242X only */
#define A2B_REG_MBOX1CTL                    (0x00000096u)            /*!<  A2B Mailbox 1 Control Register (Slave only) - AD242X only */
#define A2B_REG_MBOX1STAT                   (0x00000097u)            /*!<  A2B Mailbox 1 Status Register (Slave only) - AD242X only */
#define A2B_REG_MBOX1B0                     (0x00000098u)            /*!<  A2B Mailbox 1 Byte 0 Register (Slave only) - AD242X only */
#define A2B_REG_MBOX1B1                     (0x00000099u)            /*!<  A2B Mailbox 1 Byte 1 Register (Slave only) - AD242X only */
#define A2B_REG_MBOX1B2                     (0x0000009Au)            /*!<  A2B Mailbox 1 Byte 2 Register (Slave only) - AD242X only */
#define A2B_REG_MBOX1B3                     (0x0000009Bu)            /*!<  A2B Mailbox 1 Byte 3 Register (Slave only) - AD242X only */

