Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ============================================================================================================================ */
/** \name   Shadow Register Committed Copy Read Access Register Definitions */
/** \note   Private undocumented internal registers. Not to be modified by the user */
/* ============================================================================================================================ */
#define A2B_REG_RESPCCC                     (0x00000032u)             /*!<  A2B Response Cycles Committed Copy Register */
#define A2B_REG_DCTLCC                      (0x00000033u)             /*!<  A2B Data Control Committed Copy Register */
#define A2B_REG_DNSCC                       (0x00000034u)             /*!<  A2B Downstream Slots Committed Copy Register */
#define A2B_REG_LDNSCC                      (0x00000035u)             /*!<  A2B Local Downstream Slots Committed Copy Register (Slave Only) */
#define A2B_REG_UPSCC                       (0x00000036u)             /*!<  A2B Upstream Slots Committed Copy Register */
#define A2B_REG_LUPSCC                      (0x00000037u)             /*!<  A2B Local Upstream Slots Committed Copy Register (Slave Only) */
#define A2B_REG_BCDNSCC                     (0x00000038u)             /*!<  A2B Broadcast Downstream Slots Committed Copy Register (Slave Only) */
#define A2B_REG_SFMTCC                      (0x00000039u)             /*!<  A2B Slot Format Committed Copy Register */
/* ============================================================================================================================ */
/** \name   Chip test Register Definitions */
/** \note   Private undocumented internal registers. Not to be modified by the user */
/* ============================================================================================================================ */
#define A2B_REG_PTSTMODE                    (0x0000003Au)             /*!<  A2B Private Testmode Register */
#define A2B_REG_STRAPVAL                    (0x0000003Bu)             /*!<  A2B Strap Values Register */

#define A2B_REG_LINTTYPE                     (0x0000003Eu)            /*!<  Local Interrupt Type Slave Only */

/** \} -- needed for last name */

/** \} -- a2bstack_regdefs_offsets */

/*----------------------------------------------------------------------------*/
/** 
 * \defgroup a2bstack_regdefs_masks         Register Masks & Positions
 *  
 * A2B Field BitMasks, Positions & Enumerations
 *
 * \{ */
/*----------------------------------------------------------------------------*/

/* ============================================================================================================================ */
/** \name   A2B Register Pin Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PINCFG                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_PINCFG_IRQTS                (5u)           /*!< Tristate IRQ - AD242X Only */
#define A2B_BITP_PINCFG_IRQINV               (4u)           /*!< Invert IRQ - AD242X Only */
#define A2B_BITP_PINCFG_TXBLP                (2u)           /*!<  LVDS XCVRB Low Power TX Mode */
#define A2B_BITP_PINCFG_TXALP                (1u)           /*!<  LVDS XCVRA Low Power TX Mode */
#define A2B_BITP_PINCFG_DRVSTR               (0u)           /*!<  Digital Pin Drive Strength */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PINCFG                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_PINCFG_IRQTS                (0x00000020u)  /*!< AD242X Only */
#define A2B_BITM_PINCFG_IRQINV               (0x00000010u)  /*!< AD242X Only */
#define A2B_BITM_PINCFG_TXBLP                (0x00000004u)
#define A2B_BITM_PINCFG_TXALP                (0x00000002u)
#define A2B_BITM_PINCFG_DRVSTR               (0x00000001u)

#define A2B_REG_PINCFG_RESET                 (0x00000001u)  /*!<  Reset Value for PINCFG */
/* ============================================================================================================================ */
/** \name   A2B Analog Tuning Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        VREGCTL                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_VREGCTL_VSSEL               (0u)           /*!<  Select Vsense */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        VREGCTL                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_VREGCTL_VSSEL               (0x00000001u)

#define A2B_REG_VREGCTL_RESET                (0x00000000u)  /*!<  Reset Value for VREGCTL */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        TXACTL                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_TXACTL_TXAOVREN             (7u)           /*!<  TXA Control Override Enable */
#define A2B_BITP_TXACTL_TXASLEW              (4u)           /*!<  TXA Slew */
#define A2B_BITP_TXACTL_TXAPE                (2u)           /*!<  TXA Emphasis */
#define A2B_BITP_TXACTL_TXALEVEL             (0u)           /*!<  TXA Level */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        TXACTL                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_TXACTL_TXAOVREN             (0x00000080u)
#define A2B_BITM_TXACTL_TXASLEW              (0x00000030u)
#define A2B_BITM_TXACTL_TXAPE                (0x0000000Cu)
#define A2B_BITM_TXACTL_TXALEVEL             (0x00000003u)

#define A2B_REG_TXACTL_RESET                 (0x00000000u)  /*!<  Reset Value for TXACTL */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        RXACTL                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_RXACTL_RXAOVREN             (7u)           /*!<  RXA Control Override Enable */
#define A2B_BITP_RXACTL_RXAEQ                (6u)           /*!<  RXA Equalization Control */
#define A2B_BITP_RXACTL_RXATYPE              (5u)           /*!<  RXA Receiver Type */
#define A2B_BITP_RXACTL_RXASQEN              (4u)           /*!<  RXA Squelch Enable */
#define A2B_BITP_RXACTL_RXASQUELCH           (2u)           /*!<  RXA Squelch Control */
#define A2B_BITP_RXACTL_RXAHYS               (0u)           /*!<  RXA Hysteresis Control */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        RXACTL                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_RXACTL_RXAOVREN             (0x00000080u)
#define A2B_BITM_RXACTL_RXAEQ                (0x00000040u)
#define A2B_BITM_RXACTL_RXATYPE              (0x00000020u)
#define A2B_BITM_RXACTL_RXASQEN              (0x00000010u)
#define A2B_BITM_RXACTL_RXASQUELCH           (0x0000000Cu)
#define A2B_BITM_RXACTL_RXAHYS               (0x00000003u)

#define A2B_REG_RXACTL_RESET                 (0x00000000u)  /*!<  Reset Value for RXACTL */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        TXBCTL                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_TXBCTL_TXBOVREN             (7u)           /*!<  TXB Control Override Enable */
#define A2B_BITP_TXBCTL_TXBSLEW              (4u)           /*!<  TXB Slew */
#define A2B_BITP_TXBCTL_TXBPE                (2u)           /*!<  TXB Emphasis */
#define A2B_BITP_TXBCTL_TXBLEVEL             (0u)           /*!<  TXB Level */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        TXBCTL                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_TXBCTL_TXBOVREN             (0x00000080u)
#define A2B_BITM_TXBCTL_TXBSLEW              (0x00000030u)
#define A2B_BITM_TXBCTL_TXBPE                (0x0000000Cu)
#define A2B_BITM_TXBCTL_TXBLEVEL             (0x00000003u)

#define A2B_REG_TXBCTL_RESET                 (0x00000000u)  /*!<  Reset Value for TXBCTL */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        RXBCTL                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_RXBCTL_RXBOVREN             (7u)           /*!<  RXB Control Override Enable */
#define A2B_BITP_RXBCTL_RXBEQ                (6u)           /*!<  RXB Equalization Control */
#define A2B_BITP_RXBCTL_RXBTYPE              (5u)           /*!<  RXB Receiver Type */
#define A2B_BITP_RXBCTL_RXBSQEN              (4u)           /*!<  RXB Squelch Enable */
#define A2B_BITP_RXBCTL_RXBSQUELCH           (2u)           /*!<  RXB Squelch Control */
#define A2B_BITP_RXBCTL_RXBHYS               (0u)           /*!<  RXB Hysteresis Control */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        RXBCTL                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_RXBCTL_RXBOVREN             (0x00000080u)
#define A2B_BITM_RXBCTL_RXBEQ                (0x00000040u)
#define A2B_BITM_RXBCTL_RXBTYPE              (0x00000020u)
#define A2B_BITM_RXBCTL_RXBSQEN              (0x00000010u)
#define A2B_BITM_RXBCTL_RXBSQUELCH           (0x0000000Cu)
#define A2B_BITM_RXBCTL_RXBHYS               (0x00000003u)

