Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
#define A2B_REG_RXBCTL_RESET                 (0x00000000u)  /*!<  Reset Value for RXBCTL */
/* ============================================================================================================================ */
/** \name   A2B Config, Master Only, Auto-Broadcast, Shadowed Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SLOTFMT                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_SLOTFMT_UPFP                (7u)           /*!<  Upstream Floating Point */
#define A2B_BITP_SLOTFMT_UPFMT               (7u)           /*!<  Upstream Floating Point - AD242X naming */
#define A2B_BITP_SLOTFMT_UPSIZE              (4u)           /*!<  Upstream Slot Size */
#define A2B_BITP_SLOTFMT_DNFP                (3u)           /*!<  Downstream Floating-Point */
#define A2B_BITP_SLOTFMT_DNSIZE              (0u)           /*!<  Downstream Slot Size */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SLOTFMT                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_SLOTFMT_UPFP                (0x00000080u)
#define A2B_BITM_SLOTFMT_UPFMT               (0x00000080u)
#define A2B_BITM_SLOTFMT_UPSIZE              (0x00000070u)
#define A2B_BITM_SLOTFMT_DNFP                (0x00000008u)
#define A2B_BITM_SLOTFMT_DNSIZE              (0x00000007u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SLOTFMT                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_SLOTFMT_UPFP_EN             (0x00000080u)  /*!<  Enabled */
#define A2B_ENUM_SLOTFMT_UPFP_DIS            (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_SLOTFMT_UPFMT_EN            (0x00000080u)  /*!<  Enabled */
#define A2B_ENUM_SLOTFMT_UPFMT_DIS           (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_SLOTFMT_UPSIZE_32           (0x00000060u)  /*!<  32 Bits */
#define A2B_ENUM_SLOTFMT_UPSIZE_24           (0x00000040u)  /*!<  24 Bits */
#define A2B_ENUM_SLOTFMT_UPSIZE_12           (0x00000010u)  /*!<  12 Bits */
#define A2B_ENUM_SLOTFMT_UPSIZE_20           (0x00000030u)  /*!<  20 Bits */
#define A2B_ENUM_SLOTFMT_UPSIZE_8            (0x00000000u)  /*!<  8 Bits */
#define A2B_ENUM_SLOTFMT_UPSIZE_16           (0x00000020u)  /*!<  16 Bits */
#define A2B_ENUM_SLOTFMT_UPSIZE_28           (0x00000050u)  /*!<  28 Bits */
#define A2B_ENUM_SLOTFMT_DNFP_EN             (0x00000008u)  /*!<  Enabled */
#define A2B_ENUM_SLOTFMT_DNFP_DIS            (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_SLOTFMT_DNSIZE_32           (0x00000006u)  /*!<  32 Bits */
#define A2B_ENUM_SLOTFMT_DNSIZE_24           (0x00000004u)  /*!<  24 Bits */
#define A2B_ENUM_SLOTFMT_DNSIZE_12           (0x00000001u)  /*!<  12 Bits */
#define A2B_ENUM_SLOTFMT_DNSIZE_20           (0x00000003u)  /*!<  20 Bits */
#define A2B_ENUM_SLOTFMT_DNSIZE_8            (0x00000000u)  /*!<  8 Bits */
#define A2B_ENUM_SLOTFMT_DNSIZE_16           (0x00000002u)  /*!<  16 Bits */
#define A2B_ENUM_SLOTFMT_DNSIZE_28           (0x00000005u)  /*!<  28 Bits */

#define A2B_REG_SLOTFMT_RESET                (0x00000000u)  /*!<  Reset Value for SLOTFMT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DATCTL                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_DATCTL_STANDBY              (7u)           /*!<  Enable Standby Mode */
#define A2B_BITP_DATCTL_SCRDIS               (6u)           /*!<  Disable Scrambler */
#define A2B_BITP_DATCTL_ENDSNIFF             (5u)           /*!<  Enable Data Output on Bus Monitor Mode - AD242X only */
#define A2B_BITP_DATCTL_UPS                  (1u)           /*!<  Enable Upstream Slots */
#define A2B_BITP_DATCTL_DNS                  (0u)           /*!<  Enable Downstream Slots */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DATCTL                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_DATCTL_STANDBY              (0x00000080u)
#define A2B_BITM_DATCTL_SCRDIS               (0x00000040u)
#define A2B_BITM_DATCTL_ENDSNIFF             (0x00000020u)
#define A2B_BITM_DATCTL_UPS                  (0x00000002u)
#define A2B_BITM_DATCTL_DNS                  (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DATCTL                               Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_DATCTL_STANDBY_EN           (0x00000080u)  /*!<  Enabled */
#define A2B_ENUM_DATCTL_STANDBY_DIS          (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_DATCTL_SCRDIS_ON            (0x00000040u)  /*!<  Scrambling Disabled */
#define A2B_ENUM_DATCTL_SCRDIS_OFF           (0x00000000u)  /*!<  Scrambling Enabled */
#define A2B_ENUM_DATCTL_ENDSNIFF_ON          (0x00000020u)  /*!<  Enable Data Output on Attached Bus Monitor Node */
#define A2B_ENUM_DATCTL_ENDSNIFF_OFF         (0x00000000u)  /*!<  Disable Data Output on Attached Bus Monitor Node */
#define A2B_ENUM_DATCTL_UPS_EN               (0x00000002u)  /*!<  Enabled */
#define A2B_ENUM_DATCTL_UPS_DIS              (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_DATCTL_DNS_EN               (0x00000001u)  /*!<  Enabled */
#define A2B_ENUM_DATCTL_DNS_DIS              (0x00000000u)  /*!<  Disabled */

#define A2B_REG_DATCTL_RESET                 (0x00000000u)  /*!<  Reset Value for DATCTL */
/* ============================================================================================================================ */
/** \name   A2B Config, Shadowed Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNSLOTS                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_DNSLOTS_DNSLOTS             (0u)           /*!<  Number of Downstream Slots */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNSLOTS                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_DNSLOTS_DNSLOTS             (0x0000003Fu)

#define A2B_REG_DNSLOTS_RESET                (0x00000000u)  /*!<  Reset Value for DNSLOTS */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPSLOTS                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_UPSLOTS_UPSLOTS             (0)           /*!<  Number of Upstream Slots */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPSLOTS                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_UPSLOTS_UPSLOTS             (0x0000003F)

#define A2B_REG_UPSLOTS_RESET                (0x00000000u)  /*!<  Reset Value for UPSLOTS */
#define A2B_REG_RESPCYCS_RESET               (0x00000040u)  /*!<  Reset Value for RESPCYCS */
/* ============================================================================================================================ */
/** \name   A2B Config, Shadowed, Slave Only Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        BCDNSLOTS                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_BCDNSLOTS_BCDNSLOTS         (0u)           /*!<  Broadcast Downstream Slots */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        BCDNSLOTS                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_BCDNSLOTS_BCDNSLOTS         (0x0000003Fu)

#define A2B_REG_BCDNSLOTS_RESET              (0x00000000u)  /*!<  Reset Value for BCDNSLOTS */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        LDNSLOTS                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_LDNSLOTS_LDNSLOTS           (0u)           /*!<  Number of Downstream Slots Targeted at Local Node */
#define A2B_BITP_LDNSLOTS_DNMASKEN           (7u)           /*!<  Downstream Broadcast Mask Enable - AD242X only */

