Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        LDNSLOTS                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_LDNSLOTS_LDNSLOTS           (0x0000003Fu)
#define A2B_BITM_LDNSLOTS_DNMASKEN           (0x00000080u)  /*!< AD242X only */

#define A2B_REG_LDNSLOTS_RESET               (0x00000000u)  /*!<  Reset Value for LDNSLOTS */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        LUPSLOTS                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_LUPSLOTS_LUPSLOTS           (0u)           /*!<  Number of Upstream Slots Generated By Local Node */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        LUPSLOTS                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_LUPSLOTS_LUPSLOTS           (0x0000003Fu)

#define A2B_REG_LUPSLOTS_RESET               (0x00000000u)  /*!<  Reset Value for LUPSLOTS */
/* ============================================================================================================================ */
/** \name   A2B Configuration Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SWCTL                                Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_SWCTL_NAUTODISC             (7u)           /*!<  No Auto Disconnect - Undocumented */
#define A2B_BITP_SWCTL_DISNXT                (6u)           /*!<  Disable Next - Undocumented */
#define A2B_BITP_SWCTL_MODE                  (4u)           /*!<  External Switch Mode */
#define A2B_BITP_SWCTL_DIAGMODE              (3u)           /*!<  Enable Switch Diagnosis Mode */
#define A2B_BITP_SWCTL_ORT                   (1u)           /*!<  Open Reverse Timer - Undocumented*/
#define A2B_BITP_SWCTL_ENSW                  (0u)           /*!<  Enable Switch */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SWCTL                                Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_SWCTL_NAUTODISC             (0x00000080u)
#define A2B_BITM_SWCTL_DISNXT                (0x00000040u)
#define A2B_BITM_SWCTL_MODE                  ((0x00000030u) )
#define A2B_BITM_SWCTL_DIAGMODE              ((0x00000008u) )
#define A2B_BITM_SWCTL_ORT                   ((0x00000006u) )
#define A2B_BITM_SWCTL_ENSW                  ((0x00000001u) )
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SWCTL                                Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_SWCTL_MODE_INT_VSSN_EXT_SWP (0x00000000u)  /*!<  Use internal switch for VSSN, extern for SWP pin */
#define A2B_ENUM_SWCTL_MODE_NO_DWN_PHAN_PWR  (0x00000010u)  /*!<  Dwnstr node not using phantom pwr, not prop term bias */
#define A2B_ENUM_SWCTL_MODE_VOLT_ON_VIN      (0x00000020u)  /*!<  Voltage on the VIN pin */
#define A2B_ENUM_SWCTL_MODE_RESERVED         (0x00000030u)  /*!<  Reserved */
#define A2B_ENUM_SWCTL_DIAGMODE_EN           (0x00000008u)  /*!<  Switch Diagnosis Mode Enabled */
#define A2B_ENUM_SWCTL_DIAGMODE_DIS          (0x00000000u)  /*!<  Switch Diagnosis Mode Disabled */
#define A2B_ENUM_SWCTL_ENSW_EN               (0x00000001u)  /*!<  Switches Enabled */
#define A2B_ENUM_SWCTL_ENSW_DIS              (0x00000000u)  /*!<  Switches Disabled */

#define A2B_REG_SWCTL_RESET                  (0x00000000u)  /*!<  Reset Value for SWCTL */
/* ============================================================================================================================ */
/** \name   A2B Control Master Only Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        NODEADR                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_NODEADR_BRCST               (7u)           /*!<  Broadcast */
#define A2B_BITP_NODEADR_PERI                (5u)           /*!<  Enable Peripheral */
#define A2B_BITP_NODEADR_NODE                (0u)           /*!<  Addressed Slave Node */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        NODEADR                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_NODEADR_BRCST               (0x00000080u)
#define A2B_BITM_NODEADR_PERI                (0x00000020u)
#define A2B_BITM_NODEADR_NODE                (0x0000000Fu)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        NODEADR                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_NODEADR_BRCST_EN            (0x00000080u)  /*!<  Next write to slave nodes is handled as broadcast access */
#define A2B_ENUM_NODEADR_BRCST_DIS           (0x00000000u)  /*!<  Normal, directed register access */
#define A2B_ENUM_NODEADR_PERI_EN             (0x00000020u)  /*!<  Remote Peripheral Access enabled */
#define A2B_ENUM_NODEADR_PERI_DIS            (0x00000000u)  /*!<  Remote Peripheral Access disabled */

#define A2B_REG_NODEADR_RESET                (0x00000000u)  /*!<  Reset Value for NODEADR */
/* ============================================================================================================================ */
/** \name   A2B Control, Master Only Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CONTROL                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CONTROL_MSTR                (7u)           /*!<  Master Node - AD242X only */
#define A2B_BITP_CONTROL_SOFTRST             (2u)           /*!<  Soft Reset of Protocol Engine */
#define A2B_BITP_CONTROL_ENDDSC              (1u)           /*!<  End Discovery Mode */
#define A2B_BITP_CONTROL_NEWSTRCT            (0u)           /*!<  New Structure */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CONTROL                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_CONTROL_MSTR                (0x00000080u)  /*!<  AD242X only */
#define A2B_BITM_CONTROL_SOFTRST             (0x00000004u)
#define A2B_BITM_CONTROL_ENDDSC              (0x00000002u)
#define A2B_BITM_CONTROL_NEWSTRCT            (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CONTROL                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_CONTROL_MSTR                (0x00000080u)  /*!<  Master node - AD242X only */
#define A2B_ENUM_CONTROL_MSTR_NO_ACTION      (0x00000000u)  /*!<  Slave node */
#define A2B_ENUM_CONTROL_RESET_PE            (0x00000004u)  /*!<  Reset Protocol Engine */
#define A2B_ENUM_CONTROL_SOFTRST_NO_ACTION   (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_CONTROL_END_DISCOVERY       (0x00000002u)  /*!<  End Discovery */
#define A2B_ENUM_CONTROL_ENDDSC_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_CONTROL_START_NS            (0x00000001u)  /*!<  Enable New Structure */
#define A2B_ENUM_CONTROL_NEWSTRCT_NO_ACTION  (0x00000000u)  /*!<  No Action */

