Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
#define A2B_REG_CONTROL_RESET                (0x00000000u)  /*!<  Reset Value for CONTROL */
/* ============================================================================================================================ */
/** \name   A2B Start Discovery, Master Only Register Field Definitions */
/* ============================================================================================================================ */
#define A2B_REG_DISCVRY_RESET                (0x00000000u)             /*!<      Reset Value for DISCVRY */
/* ============================================================================================================================ */
/** \name   A2B Status Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        NODE                                 Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_NODE_LAST                   (7u)           /*!<  Last Node */
#define A2B_BITP_NODE_NLAST                  (6u)           /*!<  Next-to-Last Node */
#define A2B_BITP_NODE_DISCVD                 (5u)           /*!<  Node Discovered */
#define A2B_BITP_NODE_NUMBER                 (0u)           /*!<  Number Currently Assigned to Node */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        NODE                                 Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_NODE_LAST                   (0x00000080u)
#define A2B_BITM_NODE_NLAST                  (0x00000040u)
#define A2B_BITM_NODE_DISCVD                 (0x00000020u)
#define A2B_BITM_NODE_NUMBER                 (0x0000000Fu)

#define A2B_REG_NODE_RESET_AD241x            (0x00000080u)  /*!<  Reset Value for AD241x NODE */
#define A2B_REG_NODE_RESET_AD242X            (0x00000000u)  /*!<  Reset Value for AD242X NODE */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        TRANSTAT                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_TRANSTAT_ECCERR             (6u)           /*!<  ECC Error Code */
#define A2B_BITP_TRANSTAT_INNS               (3u)           /*!<  In New Structure Mode */
#define A2B_BITP_TRANSTAT_INDISC             (2u)           /*!<  In Discovery Mode */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        TRANSTAT                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_TRANSTAT_ECCERR             (0x000000C0u)
#define A2B_BITM_TRANSTAT_INNS               (0x00000008u)
#define A2B_BITM_TRANSTAT_INDISC             (0x00000004u)

#define A2B_REG_TRANSTAT_RESET               (0x00000000u)  /*!<  Reset Value for TRANSTAT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DISCSTAT                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_DISCSTAT_DSCACT             (7u)           /*!<  Discovery Active */
#define A2B_BITP_DISCSTAT_DNODE              (0u)           /*!<  Discovery Node */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DISCSTAT                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_DISCSTAT_DSCACT             (0x00000080u)
#define A2B_BITM_DISCSTAT_DNODE              (0x0000000Fu)

#define A2B_REG_DISCSTAT_RESET               (0x00000000u)  /*!<  Reset Value for DISCSTAT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        LINTTYPE                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_LINTTYPE_LINTTYPE           (0u)           /*!<  Local Interrupt Type - AD242X only*/
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        LINTTYPE                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_LINTTYPE_LINTTYPE           (0x000000FFu)

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        LINTTYPE                           Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_LINTTYPE_MBOX0_FULL         (48u)           /*!<  Mailbox 0 Full */
#define A2B_ENUM_LINTTYPE_MBOX0_EMPTY        (49u)           /*!<  Mailbox 0 Empty */
#define A2B_ENUM_LINTTYPE_MBOX1_FULL         (50u)           /*!<  Mailbox 1 Full */
#define A2B_ENUM_LINTTYPE_MBOX1_EMPTY        (51u)           /*!<  Mailbox 2 Empty */

#define A2B_REG_LINTTYPE_RESET               (0x00000000u)  /*!<  Reset Value for LINTTYPE */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        NSCURCNT                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_NSCURCNT_CURCNT             (0u)           /*!<  Current Count */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        NSCURCNT                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_NSCURCNT_CURCNT             (0x00000007u)

#define A2B_REG_NSCURCNT_RESET               (0x00000000u)  /*!<  Reset Value for NSCURCNT */
/* ============================================================================================================================ */
/** \name   A2B Status Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SWSTAT                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_SWSTAT_FAULT_NLOC           (7u)           /*!<  Switch Fault Not Localized */
#define A2B_BITP_SWSTAT_FAULT_CODE           (4u)           /*!<  Switch Fault Code */
#define A2B_BITP_SWSTAT_FAULT                (1u)           /*!<  Switch Fault */
#define A2B_BITP_SWSTAT_FIN                  (0u)           /*!<  Switch Activation Complete */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SWSTAT                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_SWSTAT_FAULT_NLOC           (0x00000080u)
#define A2B_BITM_SWSTAT_FAULT_CODE           (0x00000070u)
#define A2B_BITM_SWSTAT_FAULT                (0x00000002u)
#define A2B_BITM_SWSTAT_FIN                  (0x00000001u)

