Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
#define A2B_REG_SWSTAT_RESET                 (0x00000000u)  /*!<  Reset Value for SWSTAT */
/* ============================================================================================================================ */
/** \name   E-Fuse Register Field Definitions */
/* ============================================================================================================================ */
#define A2B_REG_EFUSEADDR_RESET              (0x00000000u)  /*!<  Reset Value for EFUSEADDR */
#define A2B_REG_EFUSERDAT_RESET              (0x00000000u)  /*!<  Reset Value for EFUSERDAT */
#define A2B_REG_EFUSEWDAT_RESET              (0x00000000u)  /*!<  Reset Value for EFUSEWDAT */
/* ============================================================================================================================ */
/** \name   I2C Control Slave Only Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CHIP                                 Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CHIP_CHIPADR                (0u)           /*!<  I2C Chip Address */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CHIP                                 Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_CHIP_CHIPADR                (0x0000007Fu)

#define A2B_REG_CHIP_RESET                   (0x00000050u)  /*!<  Reset Value for CHIP */
/* ============================================================================================================================ */
/** \name   I2C, I2S, and PDM Control and Configuration Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2CCFG                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2CCFG_FRAMERATE            (2u)           /*!<  Audio Frame Rate (A2B Slave Only) */
#define A2B_BITP_I2CCFG_EACK                 (1u)           /*!<  Early Acknowledge (A2B Master Only) */
#define A2B_BITP_I2CCFG_DATARATE             (0u)           /*!<  I2C Data Rate (A2B Slave Only) */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2CCFG                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2CCFG_FRAMERATE            (0x00000004u)
#define A2B_BITM_I2CCFG_EACK                 (0x00000002u)
#define A2B_BITM_I2CCFG_DATARATE             (0x00000001u)

#define A2B_REG_I2CCFG_RESET                 (0x00000000u)  /*!<  Reset Value for I2CCFG */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PLLCTL                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_PLLCTL_BCLKSEL              (2u)           /*!<  BCLK Bypass to PLL - AD241x only */
#define A2B_BITP_PLLCTL_BCLKDIV              (0u)           /*!<  BCLK PLL Multiplication Select - AD241x only */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PLLCTL                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_PLLCTL_BCLKSEL              (0x00000004u)
#define A2B_BITM_PLLCTL_BCLKDIV              (0x00000003u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PLLCTL                               Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_PLLCTL_BCLKSEL_EN           (0x00000004u)  /*!<  BCLK Selected */
#define A2B_ENUM_PLLCTL_BCLKSEL_DIS          (0x00000000u)  /*!<  SYNC Selected */
#define A2B_ENUM_PLLCTL_BCLKDIV_4X           (0x00000001u)  /*!<  2x (BCLK=24.576 MHz in TDM16) */
#define A2B_ENUM_PLLCTL_BCLKDIV_8X           (0x00000000u)  /*!<  1x (BCLK=12.288 MHz in TDM8) */
#define A2B_ENUM_PLLCTL_BCLKDIV_2X           (0x00000002u)  /*!<  4x (BCLK=49.152 MHz for TDM32) */

#define A2B_REG_PLLCTL_RESET                 (0x00000000u)  /*!<  Reset Value for PLLCTL */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SGCFG                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2SGCFG_INV                 (7u)           /*!<  Invert Sync */
#define A2B_BITP_I2SGCFG_EARLY               (6u)           /*!<  Early Sync */
#define A2B_BITP_I2SGCFG_ALT                 (5u)           /*!<  Alternating Sync */
#define A2B_BITP_I2SGCFG_TDMSS               (4u)           /*!<  TDM Slot Size */
#define A2B_BITP_I2SGCFG_TDMMODE             (0u)           /*!<  TDM Mode */
#define A2B_BITP_I2SGCFG_RXONDTX1 			 (3u)			/*!<  RX on DTX1 */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SGCFG                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2SGCFG_INV                 (0x00000080u)
#define A2B_BITM_I2SGCFG_EARLY               (0x00000040u)
#define A2B_BITM_I2SGCFG_ALT                 (0x00000020u)
#define A2B_BITM_I2SGCFG_TDMSS               (0x00000010u)
#define A2B_BITM_I2SGCFG_TDMMODE             (0x00000007u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SGCFG                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_I2SGCFG_INV_EN              (0x00000080u)  /*!<  Falling edge of SYNC pin corresponds to the start of an audio frame */
#define A2B_ENUM_I2SGCFG_INV_DIS             (0x00000000u)  /*!<  Rising edge of SYNC pin corresponds to the start of an audio frame */
#define A2B_ENUM_I2SGCFG_EARLY_EN            (0x00000040u)  /*!<  Change SYNC pin in previous cycle */
#define A2B_ENUM_I2SGCFG_EARLY_DIS           (0x00000000u)  /*!<  Change SYNC pin in same cycle */
#define A2B_ENUM_I2SGCFG_ALT_EN              (0x00000020u)  /*!<  Drive SYNC Pin Alternating */
#define A2B_ENUM_I2SGCFG_ALT_DIS             (0x00000000u)  /*!<  Drive SYNC Pin for 1 Cycle */
#define A2B_ENUM_I2SGCFG_16_BIT              (0x00000010u)  /*!<  16-Bit */
#define A2B_ENUM_I2SGCFG_32_BIT              (0x00000000u)  /*!<  32-Bit */
#define A2B_ENUM_I2SGCFG_TDM24               (0x00000006u)  /*!<  TDM24 */
#define A2B_ENUM_I2SGCFG_TDM16               (0x00000004u)  /*!<  TDM16 */
#define A2B_ENUM_I2SGCFG_TDM4                (0x00000001u)  /*!<  TDM4 */
#define A2B_ENUM_I2SGCFG_TDM12               (0x00000003u)  /*!<  TDM12 */
#define A2B_ENUM_I2SGCFG_TDM2                (0x00000000u)  /*!<  TDM2 */
#define A2B_ENUM_I2SGCFG_TDM32               (0x00000007u)  /*!<  TDM32 */
#define A2B_ENUM_I2SGCFG_TDM8                (0x00000002u)  /*!<  TDM8 */
#define A2B_ENUM_I2SGCFG_TDM20               (0x00000005u)  /*!<  TDM20 */

#define A2B_REG_I2SGCFG_RESET                (0x00000000u)  /*!<  Reset Value for I2SGCFG */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SCFG                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2SCFG_RXBCLKINV            (7u)           /*!<  RX BCLK Invert */
#define A2B_BITP_I2SCFG_RX2PINTL             (6u)           /*!<  RX 2 Pin Interleave */
#define A2B_BITP_I2SCFG_RX1EN                (5u)           /*!<  I2S RX 1 Enable */
#define A2B_BITP_I2SCFG_RX0EN                (4u)           /*!<  I2S RX 0 Enable */
#define A2B_BITP_I2SCFG_TXBCLKINV            (3u)           /*!<  TX BCLK Invert */
#define A2B_BITP_I2SCFG_TX2PINTL             (2u)           /*!<  TX 2 Pin Interleave */
#define A2B_BITP_I2SCFG_TX1EN                (1u)           /*!<  I2S TX 1 Enable */
#define A2B_BITP_I2SCFG_TX0EN                (0u)           /*!<  I2S TX 0 Enable */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SCFG                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2SCFG_RXBCLKINV            (0x00000080u)
#define A2B_BITM_I2SCFG_RX2PINTL             (0x00000040u)
#define A2B_BITM_I2SCFG_RX1EN                (0x00000020u)
#define A2B_BITM_I2SCFG_RX0EN                (0x00000010u)
#define A2B_BITM_I2SCFG_TXBCLKINV            (0x00000008u)
#define A2B_BITM_I2SCFG_TX2PINTL             (0x00000004u)
#define A2B_BITM_I2SCFG_TX1EN                (0x00000002u)
#define A2B_BITM_I2SCFG_TX0EN                (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SCFG                               Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_I2SCFG_RXBCLKINV_EN         (0x00000080u)  /*!<  Enabled */
#define A2B_ENUM_I2SCFG_RXBCLKINV_DIS        (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SCFG_RX2PINTL_EN          (0x00000040u)  /*!<  Enabled */
#define A2B_ENUM_I2SCFG_RX2PINTL_DIS         (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SCFG_RX1EN_EN             (0x00000020u)  /*!<  Enabled */
#define A2B_ENUM_I2SCFG_RX1EN_DIS            (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SCFG_RX0EN_EN             (0x00000010u)  /*!<  Enabled */
#define A2B_ENUM_I2SCFG_RX0EN_DIS            (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SCFG_TXBCLKINV_EN         (0x00000008u)  /*!<  Enabled */
#define A2B_ENUM_I2SCFG_TXBCLKINV_DIS        (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SCFG_TX2PINTL_EN          (0x00000004u)  /*!<  Enabled */
#define A2B_ENUM_I2SCFG_TX2PINTL_DIS         (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SCFG_TX1EN_EN             (0x00000002u)  /*!<  Enabled */
#define A2B_ENUM_I2SCFG_TX1EN_DIS            (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SCFG_TX0EN_EN             (0x00000001u)  /*!<  Enabled */
#define A2B_ENUM_I2SCFG_TX0EN_DIS            (0x00000000u)  /*!<  Disabled */

#define A2B_REG_I2SCFG_RESET                 (0x00000000u)  /*!<  Reset Value for I2SCFG */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRATE                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2SRATE_SHARE               (7u)           /*!<  Share Bus Slots in Reduced Rate Mode - AD242X only */
#define A2B_BITP_I2SRATE_REDUCE              (6u)           /*!<  Reduce and Duplicate */
#define A2B_BITP_I2SRATE_FRAMES              (4u)           /*!<  Superframes Used - AD241x only*/
#define A2B_BITP_I2SRATE_BLCKRATE            (3u)           /*!<  BCLK Frequency - AD242X only*/
#define A2B_BITP_I2SRATE_I2SRATE             (0u)           /*!<  I2S Rate Setting */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRATE                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2SRATE_SHARE               (0x00000080u)  /*!<  AD242X only */
#define A2B_BITM_I2SRATE_REDUCE              (0x00000040u)
#define A2B_BITM_I2SRATE_FRAMES              (0x00000030u)
#define A2B_BITM_I2SRATE_BCLKRATE            (0x00000038u)
#define A2B_BITM_I2SRATE_I2SRATE             (0x00000007u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRATE                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_I2SRATE_SHARE_EN            (0x00000080u)  /*!<  Enabled - AD242X only */
#define A2B_ENUM_I2SRATE_SHARE_DIS           (0x00000000u)  /*!<  Disabled - AD242X only */
#define A2B_ENUM_I2SRATE_REDUCE_EN           (0x00000040u)  /*!<  Enabled */
#define A2B_ENUM_I2SRATE_REDUCE_DIS          (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SRATE_FRAMES_EN           (0x00000010u)  /*!<  Enabled */
#define A2B_ENUM_I2SRATE_FRAMES_DIS          (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_I2SRATE_4X_SFF              (0x00000006u)  /*!<  SFF x 4 */
#define A2B_ENUM_I2SRATE_2X_SFF              (0x00000005u)  /*!<  SFF x 2 */
#define A2B_ENUM_I2SRATE_SFF_RRDIV           (0x00000003u)  /*!<  SFF / RRDIV */
#define A2B_ENUM_I2SRATE_SFF_DIV_4           (0x00000002u)  /*!<  SFF / 4 */
#define A2B_ENUM_I2SRATE_SFF_DIV_2           (0x00000001u)  /*!<  SFF / 2 */
#define A2B_ENUM_I2SRATE_1X_SFF              (0x00000000u)  /*!<  1x SFF */

