Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
#define A2B_REG_I2SRATE_RESET                (0x00000000u)  /*!<  Reset Value for I2SRATE */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRATE                           Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2SRRATE_RBUS               (7u)           /*!<  Reduced Data Rate - AD242X only */
#define A2B_BITP_I2SRRATE_RRDIV              (0u)           /*!<  Reduced Rate Divide - AD242X only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRATE                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2SRRATE_RBUS               (0x00000080u)  /*!<  AD242X only */
#define A2B_BITM_I2SRRATE_RRDIV              (0x0000003Fu)  /*!<  AD242X only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRATE                             Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_I2SRRATE_RBUS_EN            (0x00000080u)  /*!<  Enabled - AD242X only */
#define A2B_ENUM_I2SRRATE_RBUS_DIS           (0x00000000u)  /*!<  Disabled - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_1            (0x00000001u)  /*!< 1:1 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_2            (0x00000002u)  /*!< 2:2 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_4            (0x00000004u)  /*!< 4:4 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_8            (0x00000008u)  /*!< 8:8 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_12           (0x00000012u)  /*!< 12:12 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_16           (0x00000016u)  /*!< 16:16 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_20           (0x00000020u)  /*!< 20:20 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_24           (0x00000024u)  /*!< 24:24 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_28           (0x00000028u)  /*!< 28:28 - AD242X only */
#define A2B_ENUM_I2SRRATE_RRDIV_32           (0x00000032u)  /*!< 32:32 - AD242X only */

#define A2B_REG_I2SRRATE_RESET               (0x00000000u)  /*!<  Reset Value for I2SRRATE */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRCTL                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2SRRCTL_ENCHAN             (6u)           /*!<  Enable I2S Reduced Rate Valid Bits in Extra I2S Channel- AD242X only */
#define A2B_BITP_I2SRRCTL_STRBDIR            (5u)           /*!<  I2S Reduced Rate Strobe Direction - AD242X only */
#define A2B_BITP_I2SRRCTL_ENSTRB             (4u)           /*!<  Enable I2S Reduced Rate Strobe - AD242X only */
#define A2B_BITP_I2SRRCTL_ENXBIT             (1u)           /*!<  Enable I2S Reduced Rate Valid Bit in Extra Bit - AD242X only */
#define A2B_BITP_I2SRRCTL_ENVLSB             (0u)           /*!<  Enable I2S Reduced Rate Valid Bit in LSB - AD242X only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRCTL                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2SRRCTL_ENCHAN             (0x00000040u)  /*!<  AD242X only */
#define A2B_BITM_I2SRRCTL_STRBDIR            (0x00000020u)  /*!<  AD242X only */
#define A2B_BITM_I2SRRCTL_ENSTRB             (0x00000010u)  /*!<  AD242X only */
#define A2B_BITM_I2SRRCTL_ENXBIT             (0x00000002u)  /*!<  AD242X only */
#define A2B_BITM_I2SRRCTL_ENVLSB             (0x00000001u)  /*!<  AD242X only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRCTL                             Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_I2SRRCTL_ENCHAN_EN          (0x00000040u)  /*!<  Enabled - AD242X only */
#define A2B_ENUM_I2SRRCTL_ENCHAN_DIS         (0x00000000u)  /*!<  Disabled - AD242X only */
#define A2B_ENUM_I2SRRCTL_STRBDIR_OUT        (0x00000020u)  /*!<  Out - AD242X only */
#define A2B_ENUM_I2SRRCTL_STRBDIR_IN         (0x00000000u)  /*!<  In - AD242X only */
#define A2B_ENUM_I2SRRCTL_ENSTRB_EN          (0x00000010u)  /*!<  Enabled - AD242X only */
#define A2B_ENUM_I2SRRCTL_ENSTRB_DIS         (0x00000000u)  /*!<  Disabled - AD242X only */
#define A2B_ENUM_I2SRRCTL_ENXBIT_EN          (0x00000002u)  /*!<  Enabled - AD242X only */
#define A2B_ENUM_I2SRRCTL_ENXBIT_DIS         (0x00000000u)  /*!<  Disabled - AD242X only */
#define A2B_ENUM_I2SRRCTL_ENVLSB_EN          (0x00000001u)  /*!<  Enabled - AD242X only */
#define A2B_ENUM_I2SRRCTL_ENVLSB_DIS         (0x00000000u)  /*!<  Disabled - AD242X only */


#define A2B_REG_I2SRRCTL_RESET               (0x00000000u)  /*!<  Reset Value for I2SRRCTL */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRSOFFS                           Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2SRRSOFFS_RRSOFFSET        (0u)           /*!<  I2S Reduced Rate SYNC Offset  - AD242X only, slave only */

