Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRSOFFS                           Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2SRRSOFFS_RRSOFFSET        (0x00000003u)  /*!<  AD242X only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRRSOFFS                           Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_I2SRRSOFFS_OFFSET_0         (0x00000000u)  /*!<  Offset by 0 superframes - AD242X only */
#define A2B_ENUM_I2SRRSOFFS_OFFSET_1         (0x00000001u)  /*!<  Offset by 1 superframes - AD242X only */
#define A2B_ENUM_I2SRRSOFFS_OFFSET_2         (0x00000002u)  /*!<  Offset by 2 superframes - AD242X only */
#define A2B_ENUM_I2SRRSOFFS_OFFSET_3         (0x00000003u)  /*!<  Offset by 3 superframes - AD242X only */

#define A2B_REG_I2SRRSOFFS_RESET             (0x00000000u)  /*!<  Reset Value for I2SRRCTL */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKOUT1                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CLKOUT1_CLK1EN              (7u)           /*!<  CLKOUT1 Enable  - AD242X only*/
#define A2B_BITP_CLKOUT1_CLK1INV             (6u)           /*!<  CLKOUT1 Invert Enable  - AD242X only*/
#define A2B_BITP_CLKOUT1_CLK1PDIV            (5u)           /*!<  CLKOUT1 Pre-Divide Value  - AD242X only*/
#define A2B_BITP_CLKOUT1_CLK1DIV             (0u)           /*!<  CLKOUT1 Divide Value  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKOUT1                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_CLKOUT1_CLK1EN           (0x00000080u)     /*!<  AD242X only*/
#define A2B_BITM_CLKOUT1_CLK1INV          (0x00000040u)     /*!<  AD242X only*/
#define A2B_BITM_CLKOUT1_CLK1PDIV         (0x00000020u)     /*!<  AD242X only*/
#define A2B_BITM_CLKOUT1_CLK1DIV          (0x0000000Fu)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKOUT1                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_CLKOUT1_CLK1EN_EN        (0x00000080u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT1_CLK1EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT1_CLK1INV_EN       (0x00000040u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT1_CLK1INV_DIS      (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT1_CLK1PDIV_32      (0x00000020u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT1_CLK1PDIV_2       (0x00000000u)  /*!<  AD242X only */


#define A2B_REG_CLKOUT1_RESET             (0x00000000u)  /*!<  Reset Value for CLKOUT1 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKOUT2                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CLKOUT2_CLK1EN              (7u)           /*!<  CLKOUT2 Enable  - AD242X only*/
#define A2B_BITP_CLKOUT2_CLK1INV             (6u)           /*!<  CLKOUT2 Invert Enable  - AD242X only*/
#define A2B_BITP_CLKOUT2_CLK1PDIV            (5u)           /*!<  CLKOUT2 Pre-Divide Value  - AD242X only*/
#define A2B_BITP_CLKOUT2_CLK1DIV             (0u)           /*!<  CLKOUT2 Divide Value  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKOUT2                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_CLKOUT2_CLK1EN           (0x00000080u)     /*!<  AD242X only*/
#define A2B_BITM_CLKOUT2_CLK1INV          (0x00000040u)     /*!<  AD242X only*/
#define A2B_BITM_CLKOUT2_CLK1PDIV         (0x00000020u)     /*!<  AD242X only*/
#define A2B_BITM_CLKOUT2_CLK1DIV          (0x0000000Fu)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKOUT2                             Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_CLKOUT2_CLK1EN_EN        (0x00000080u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT2_CLK1EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT2_CLK1INV_EN       (0x00000040u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT2_CLK1INV_DIS      (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT2_CLK1PDIV_32      (0x00000020u)  /*!<  AD242X only */
#define A2B_ENUM_CLKOUT2_CLK1PDIV_2       (0x00000000u)  /*!<  AD242X only */


#define A2B_REG_CLKOUT2_RESET             (0x00000000u)  /*!<  Reset Value for CLKOUT2 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        BMMCFG                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_BMMCFG_BMMNDSC             (2u)           /*!<  BMM No Discovery Mode Enable  - AD242X only*/
#define A2B_BITP_BMMCFG_BMMRXEN             (1u)           /*!<  BMM LVDS XCVR RX Enable  - AD242X only*/
#define A2B_BITP_BMMCFG_BMMEN               (0u)           /*!<  Bus Monitor Mode Enable  - AD242X only*/

