Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        BMMCFG                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_BMMCFG_BMMNDSC          (0x00000004u)     /*!<  AD242X only*/
#define A2B_BITM_BMMCFG_BMMRXEN          (0x00000002u)     /*!<  AD242X only*/
#define A2B_BITM_BMMCFG_BMMEN            (0x00000001u)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        BMMCFG                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_BMMCFG_BMMNDSC_EN       (0x00000004u)    /*!<  AD242X only */
#define A2B_ENUM_BMMCFG_BMMNDSC_DIS      (0x00000000u)    /*!<  AD242X only */
#define A2B_ENUM_BMMCFG_BMMRXEN_EN       (0x00000002u)    /*!<  AD242X only */
#define A2B_ENUM_BMMCFG_BMMRXEN_DIS      (0x00000000u)    /*!<  AD242X only */
#define A2B_ENUM_BMMCFG_BMMEN_EN         (0x00000001u)    /*!<  AD242X only */
#define A2B_ENUM_BMMCFG_BMMEN_DIS        (0x00000000u)    /*!<  AD242X only */



#define A2B_REG_BMMCFG_RESET             (0x00000000u)  /*!<  Reset Value for BMMCFG */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SUSCFG                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_SUSCFG_SUSDIS              (5u)           /*!<  Sustain disable  - AD242X only*/
#define A2B_BITP_SUSCFG_SUSOE               (4u)           /*!<  Sustain GPIO Output Enable  - AD242X only*/
#define A2B_BITP_SUSCFG_SUSSEL              (0u)           /*!<  Sustain GPIO Output Select  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SUSCFG                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_SUSCFG_SUSDIS           (0x00000020u)     /*!<  AD242X only*/
#define A2B_BITM_SUSCFG_SUSOE            (0x00000010u)     /*!<  AD242X only*/
#define A2B_BITM_SUSCFG_SUSSEL           (0x00000007u)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        SUSCFG                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_SUSCFG_SUSDIS_EN        (0x00000020u)    /*!<  AD242X only */
#define A2B_ENUM_SUSCFG_SUSDIS_DIS       (0x00000000u)    /*!<  AD242X only */
#define A2B_ENUM_SUSCFG_SUSOE_EN         (0x00000010u)    /*!<  AD242X only */
#define A2B_ENUM_SUSCFG_SUSOE_DIS        (0x00000000u)    /*!<  AD242X only */

#define A2B_REG_SUSCFG_RESET             (0x00000000u)    /*!<  Reset Value for SUSCFG */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK0                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_UPMASK0_RXUPSLOT07          (7u)       /*!<  Receive Upstream Data Slot 7  - AD242X only, slave only */
#define A2B_BITP_UPMASK0_RXUPSLOT06          (6u)       /*!<  Receive Upstream Data Slot 6  - AD242X only, slave only */
#define A2B_BITP_UPMASK0_RXUPSLOT05          (5u)       /*!<  Receive Upstream Data Slot 5  - AD242X only, slave only */
#define A2B_BITP_UPMASK0_RXUPSLOT04          (4u)       /*!<  Receive Upstream Data Slot 4  - AD242X only, slave only */
#define A2B_BITP_UPMASK0_RXUPSLOT03          (3u)       /*!<  Receive Upstream Data Slot 3  - AD242X only, slave only */
#define A2B_BITP_UPMASK0_RXUPSLOT02          (2u)       /*!<  Receive Upstream Data Slot 2  - AD242X only, slave only */
#define A2B_BITP_UPMASK0_RXUPSLOT01          (1u)       /*!<  Receive Upstream Data Slot 1  - AD242X only, slave only */
#define A2B_BITP_UPMASK0_RXUPSLOT00          (0u)       /*!<  Receive Upstream Data Slot 0  - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK0                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_UPMASK0_RXUPSLOT07      (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK0_RXUPSLOT06      (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK0_RXUPSLOT05      (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK0_RXUPSLOT04      (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK0_RXUPSLOT03      (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK0_RXUPSLOT02      (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK0_RXUPSLOT01      (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK0_RXUPSLOT00      (0x00000001u)  /*!<  AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK0                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_UPMASK0_RXUPSLOT07_EN   (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT07_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT06_EN   (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT06_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT05_EN   (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT05_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT04_EN   (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT04_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT03_EN   (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT03_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT02_EN   (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT02_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT01_EN   (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT01_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT00_EN   (0x00000001u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK0_RXUPSLOT00_DIS  (0x00000000u)  /*!<  AD242X only, slave only */


#define A2B_REG_UPMASK0_RESET            (0x00000000u)    /*!<  Reset Value for UPMASK0 */

