Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK1                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_UPMASK1_RXUPSLOT15          (7u)       /*!<  Receive Upstream Data Slot 15  - AD242X only, slave only */
#define A2B_BITP_UPMASK1_RXUPSLOT14          (6u)       /*!<  Receive Upstream Data Slot 14 - AD242X only, slave only */
#define A2B_BITP_UPMASK1_RXUPSLOT13          (5u)       /*!<  Receive Upstream Data Slot 13 - AD242X only, slave only */
#define A2B_BITP_UPMASK1_RXUPSLOT12          (4u)       /*!<  Receive Upstream Data Slot 12 - AD242X only, slave only */
#define A2B_BITP_UPMASK1_RXUPSLOT11          (3u)       /*!<  Receive Upstream Data Slot 11 - AD242X only, slave only */
#define A2B_BITP_UPMASK1_RXUPSLOT10          (2u)       /*!<  Receive Upstream Data Slot 10 - AD242X only, slave only */
#define A2B_BITP_UPMASK1_RXUPSLOT09          (1u)       /*!<  Receive Upstream Data Slot 9 - AD242X only, slave only */
#define A2B_BITP_UPMASK1_RXUPSLOT08          (0u)       /*!<  Receive Upstream Data Slot 8  - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK1                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_UPMASK1_RXUPSLOT15      (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK1_RXUPSLOT14      (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK1_RXUPSLOT13      (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK1_RXUPSLOT12      (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK1_RXUPSLOT11      (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK1_RXUPSLOT10      (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK1_RXUPSLOT09      (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK1_RXUPSLOT08      (0x00000001u)  /*!<  AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK1                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_UPMASK1_RXUPSLOT15_EN   (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT15_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT14_EN   (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT14_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT13_EN   (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT13_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT12_EN   (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT12_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT11_EN   (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT11_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT10_EN   (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT10_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT09_EN   (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT09_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT08_EN   (0x00000001u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK1_RXUPSLOT08_DIS  (0x00000000u)  /*!<  AD242X only, slave only */


#define A2B_REG_UPMASK1_RESET            (0x00000000u)    /*!<  Reset Value for UPMASK1 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK2                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_UPMASK2_RXUPSLOT23          (7u)       /*!<  Receive Upstream Data Slot 23 - AD242X only, slave only */
#define A2B_BITP_UPMASK2_RXUPSLOT22          (6u)       /*!<  Receive Upstream Data Slot 22 - AD242X only, slave only */
#define A2B_BITP_UPMASK2_RXUPSLOT21          (5u)       /*!<  Receive Upstream Data Slot 21 - AD242X only, slave only */
#define A2B_BITP_UPMASK2_RXUPSLOT20          (4u)       /*!<  Receive Upstream Data Slot 20 - AD242X only, slave only */
#define A2B_BITP_UPMASK2_RXUPSLOT19          (3u)       /*!<  Receive Upstream Data Slot 19 - AD242X only, slave only */
#define A2B_BITP_UPMASK2_RXUPSLOT18          (2u)       /*!<  Receive Upstream Data Slot 18 - AD242X only, slave only */
#define A2B_BITP_UPMASK2_RXUPSLOT17          (1u)       /*!<  Receive Upstream Data Slot 17 - AD242X only, slave only */
#define A2B_BITP_UPMASK2_RXUPSLOT16          (0u)       /*!<  Receive Upstream Data Slot 16 - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK2                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_UPMASK2_RXUPSLOT23      (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK2_RXUPSLOT22      (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK2_RXUPSLOT21      (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK2_RXUPSLOT20      (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK2_RXUPSLOT19      (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK2_RXUPSLOT18      (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK2_RXUPSLOT17      (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK2_RXUPSLOT16      (0x00000001u)  /*!<  AD242X only, slave only */

