Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK2                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_UPMASK2_RXUPSLOT23_EN   (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT23_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT22_EN   (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT22_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT21_EN   (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT21_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT20_EN   (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT20_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT19_EN   (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT19_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT18_EN   (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT18_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT17_EN   (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT17_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT16_EN   (0x00000001u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK2_RXUPSLOT16_DIS  (0x00000000u)  /*!<  AD242X only, slave only */


#define A2B_REG_UPMASK2_RESET            (0x00000000u)    /*!<  Reset Value for UPMASK2 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK3                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_UPMASK3_RXUPSLOT31          (7u)       /*!<  Receive Upstream Data Slot 31 - AD242X only, slave only */
#define A2B_BITP_UPMASK3_RXUPSLOT30          (6u)       /*!<  Receive Upstream Data Slot 30 - AD242X only, slave only */
#define A2B_BITP_UPMASK3_RXUPSLOT29          (5u)       /*!<  Receive Upstream Data Slot 29 - AD242X only, slave only */
#define A2B_BITP_UPMASK3_RXUPSLOT28          (4u)       /*!<  Receive Upstream Data Slot 28 - AD242X only, slave only */
#define A2B_BITP_UPMASK3_RXUPSLOT27          (3u)       /*!<  Receive Upstream Data Slot 27 - AD242X only, slave only */
#define A2B_BITP_UPMASK3_RXUPSLOT26          (2u)       /*!<  Receive Upstream Data Slot 26 - AD242X only, slave only */
#define A2B_BITP_UPMASK3_RXUPSLOT25          (1u)       /*!<  Receive Upstream Data Slot 25 - AD242X only, slave only */
#define A2B_BITP_UPMASK3_RXUPSLOT24          (0u)       /*!<  Receive Upstream Data Slot 24 - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK3                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_UPMASK3_RXUPSLOT31      (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK3_RXUPSLOT30      (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK3_RXUPSLOT29      (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK3_RXUPSLOT28      (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK3_RXUPSLOT27      (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK3_RXUPSLOT26      (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK3_RXUPSLOT25      (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_BITM_UPMASK3_RXUPSLOT24      (0x00000001u)  /*!<  AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPMASK3                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_UPMASK3_RXUPSLOT31_EN   (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT31_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT30_EN   (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT30_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT29_EN   (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT29_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT28_EN   (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT28_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT27_EN   (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT27_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT26_EN   (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT26_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT25_EN   (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT25_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT24_EN   (0x00000001u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_UPMASK3_RXUPSLOT24_DIS  (0x00000000u)  /*!<  AD242X only, slave only */


#define A2B_REG_UPMASK3_RESET            (0x00000000u)    /*!<  Reset Value for UPMASK3 */

