Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPOFFSET                        Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_UPOFFSET_UPOFFSET       (0u)           /*!<  Upstream Slots Offset for Local Node  - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        UPOFFSET                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_UPOFFSET_UPOFFSET       (0x0000001Fu)  /*!<  AD242X only, slave only */

#define A2B_REG_UPOFFSET_RESET           (0x00000000u)    /*!<  Reset Value for UPMASK3 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK0                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_DNMASK0_RXDNSLOT07          (7u)       /*!<  Receive DownStream Data Slot 7  - AD242X only, slave only */
#define A2B_BITP_DNMASK0_RXDNSLOT06          (6u)       /*!<  Receive DownStream Data Slot 6  - AD242X only, slave only */
#define A2B_BITP_DNMASK0_RXDNSLOT05          (5u)       /*!<  Receive DownStream Data Slot 5  - AD242X only, slave only */
#define A2B_BITP_DNMASK0_RXDNSLOT04          (4u)       /*!<  Receive DownStream Data Slot 4  - AD242X only, slave only */
#define A2B_BITP_DNMASK0_RXDNSLOT03          (3u)       /*!<  Receive DownStream Data Slot 3  - AD242X only, slave only */
#define A2B_BITP_DNMASK0_RXDNSLOT02          (2u)       /*!<  Receive DownStream Data Slot 2  - AD242X only, slave only */
#define A2B_BITP_DNMASK0_RXDNSLOT01          (1u)       /*!<  Receive DownStream Data Slot 1  - AD242X only, slave only */
#define A2B_BITP_DNMASK0_RXDNSLOT00          (0u)       /*!<  Receive DownStream Data Slot 0  - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK0                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_DNMASK0_RXDNSLOT07      (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK0_RXDNSLOT06      (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK0_RXDNSLOT05      (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK0_RXDNSLOT04      (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK0_RXDNSLOT03      (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK0_RXDNSLOT02      (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK0_RXDNSLOT01      (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK0_RXDNSLOT00      (0x00000001u)  /*!<  AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK0                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_DNMASK0_RXDNSLOT07_EN   (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT07_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT06_EN   (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT06_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT05_EN   (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT05_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT04_EN   (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT04_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT03_EN   (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT03_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT02_EN   (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT02_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT01_EN   (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT01_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT00_EN   (0x00000001u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK0_RXDNSLOT00_DIS  (0x00000000u)  /*!<  AD242X only, slave only */


#define A2B_REG_DNMASK0_RESET            (0x00000000u)    /*!<  Reset Value for DNMASK0 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK1                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_DNMASK1_RXDNSLOT15          (7u)       /*!<  Receive DownStream Data Slot 15  - AD242X only, slave only */
#define A2B_BITP_DNMASK1_RXDNSLOT14          (6u)       /*!<  Receive DownStream Data Slot 14 - AD242X only, slave only */
#define A2B_BITP_DNMASK1_RXDNSLOT13          (5u)       /*!<  Receive DownStream Data Slot 13 - AD242X only, slave only */
#define A2B_BITP_DNMASK1_RXDNSLOT12          (4u)       /*!<  Receive DownStream Data Slot 12 - AD242X only, slave only */
#define A2B_BITP_DNMASK1_RXDNSLOT11          (3u)       /*!<  Receive DownStream Data Slot 11 - AD242X only, slave only */
#define A2B_BITP_DNMASK1_RXDNSLOT10          (2u)       /*!<  Receive DownStream Data Slot 10 - AD242X only, slave only */
#define A2B_BITP_DNMASK1_RXDNSLOT09          (1u)       /*!<  Receive DownStream Data Slot 9 - AD242X only, slave only */
#define A2B_BITP_DNMASK1_RXDNSLOT08          (0u)       /*!<  Receive DownStream Data Slot 8  - AD242X only, slave only */

