Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK1                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_DNMASK1_RXDNSLOT15      (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK1_RXDNSLOT14      (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK1_RXDNSLOT13      (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK1_RXDNSLOT12      (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK1_RXDNSLOT11      (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK1_RXDNSLOT10      (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK1_RXDNSLOT09      (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK1_RXDNSLOT08      (0x00000001u)  /*!<  AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK1                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_DNMASK1_RXDNSLOT15_EN   (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT15_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT14_EN   (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT14_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT13_EN   (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT13_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT12_EN   (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT12_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT11_EN   (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT11_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT10_EN   (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT10_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT09_EN   (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT09_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT08_EN   (0x00000001u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK1_RXDNSLOT08_DIS  (0x00000000u)  /*!<  AD242X only, slave only */


#define A2B_REG_DNMASK1_RESET            (0x00000000u)    /*!<  Reset Value for DNMASK1 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK2                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_DNMASK2_RXDNSLOT23          (7u)       /*!<  Receive DownStream Data Slot 23 - AD242X only, slave only */
#define A2B_BITP_DNMASK2_RXDNSLOT22          (6u)       /*!<  Receive DownStream Data Slot 22 - AD242X only, slave only */
#define A2B_BITP_DNMASK2_RXDNSLOT21          (5u)       /*!<  Receive DownStream Data Slot 21 - AD242X only, slave only */
#define A2B_BITP_DNMASK2_RXDNSLOT20          (4u)       /*!<  Receive DownStream Data Slot 20 - AD242X only, slave only */
#define A2B_BITP_DNMASK2_RXDNSLOT19          (3u)       /*!<  Receive DownStream Data Slot 19 - AD242X only, slave only */
#define A2B_BITP_DNMASK2_RXDNSLOT18          (2u)       /*!<  Receive DownStream Data Slot 18 - AD242X only, slave only */
#define A2B_BITP_DNMASK2_RXDNSLOT17          (1u)       /*!<  Receive DownStream Data Slot 17 - AD242X only, slave only */
#define A2B_BITP_DNMASK2_RXDNSLOT16          (0u)       /*!<  Receive DownStream Data Slot 16 - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK2                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_DNMASK2_RXDNSLOT23      (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK2_RXDNSLOT22      (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK2_RXDNSLOT21      (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK2_RXDNSLOT20      (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK2_RXDNSLOT19      (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK2_RXDNSLOT18      (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK2_RXDNSLOT17      (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK2_RXDNSLOT16      (0x00000001u)  /*!<  AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK2                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_DNMASK2_RXDNSLOT23_EN   (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT23_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT22_EN   (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT22_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT21_EN   (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT21_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT20_EN   (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT20_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT19_EN   (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT19_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT18_EN   (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT18_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT17_EN   (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT17_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT16_EN   (0x00000001u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK2_RXDNSLOT16_DIS  (0x00000000u)  /*!<  AD242X only, slave only */


#define A2B_REG_DNMASK2_RESET            (0x00000000u)    /*!<  Reset Value for DNMASK2 */

