Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK3                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_DNMASK3_RXDNSLOT31          (7u)       /*!<  Receive DownStream Data Slot 31 - AD242X only, slave only */
#define A2B_BITP_DNMASK3_RXDNSLOT30          (6u)       /*!<  Receive DownStream Data Slot 30 - AD242X only, slave only */
#define A2B_BITP_DNMASK3_RXDNSLOT29          (5u)       /*!<  Receive DownStream Data Slot 29 - AD242X only, slave only */
#define A2B_BITP_DNMASK3_RXDNSLOT28          (4u)       /*!<  Receive DownStream Data Slot 28 - AD242X only, slave only */
#define A2B_BITP_DNMASK3_RXDNSLOT27          (3u)       /*!<  Receive DownStream Data Slot 27 - AD242X only, slave only */
#define A2B_BITP_DNMASK3_RXDNSLOT26          (2u)       /*!<  Receive DownStream Data Slot 26 - AD242X only, slave only */
#define A2B_BITP_DNMASK3_RXDNSLOT25          (1u)       /*!<  Receive DownStream Data Slot 25 - AD242X only, slave only */
#define A2B_BITP_DNMASK3_RXDNSLOT24          (0u)       /*!<  Receive DownStream Data Slot 24 - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK3                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_DNMASK3_RXDNSLOT31      (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK3_RXDNSLOT30      (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK3_RXDNSLOT29      (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK3_RXDNSLOT28      (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK3_RXDNSLOT27      (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK3_RXDNSLOT26      (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK3_RXDNSLOT25      (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_BITM_DNMASK3_RXDNSLOT24      (0x00000001u)  /*!<  AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNMASK3                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_DNMASK3_RXDNSLOT31_EN   (0x00000080u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT31_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT30_EN   (0x00000040u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT30_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT29_EN   (0x00000020u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT29_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT28_EN   (0x00000010u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT28_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT27_EN   (0x00000008u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT27_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT26_EN   (0x00000004u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT26_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT25_EN   (0x00000002u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT25_DIS  (0x00000000u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT24_EN   (0x00000001u)  /*!<  AD242X only, slave only */
#define A2B_ENUM_DNMASK3_RXDNSLOT24_DIS  (0x00000000u)  /*!<  AD242X only, slave only */


#define A2B_REG_DNMASK3_RESET            (0x00000000u)    /*!<  Reset Value for DNMASK3 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNOFFSET                        Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_DNOFFSET_DNOFFSET       (0u)           /*!<  DownStream Slots Offset for Local Node  - AD242X only, slave only */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        DNOFFSET                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_DNOFFSET_DNOFFSET       (0x0000001Fu)  /*!<  AD242X only, slave only */

#define A2B_REG_DNOFFSET_RESET           (0x00000000u)    /*!<  Reset Value for DNMASK3 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODEN                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIODEN_IOD7EN              (7u)           /*!<  Sustain disable  - AD242X only*/
#define A2B_BITP_GPIODEN_IOD6EN              (6u)           /*!<  Sustain GPIO Output Enable  - AD242X only*/
#define A2B_BITP_GPIODEN_IOD5EN              (5u)           /*!<  Sustain GPIO Output Select  - AD242X only*/
#define A2B_BITP_GPIODEN_IOD4EN              (4u)           /*!<  Sustain GPIO Output Select  - AD242X only*/
#define A2B_BITP_GPIODEN_IOD3EN              (3u)           /*!<  Sustain GPIO Output Select  - AD242X only*/
#define A2B_BITP_GPIODEN_IOD2EN              (2u)           /*!<  Sustain GPIO Output Select  - AD242X only*/
#define A2B_BITP_GPIODEN_IOD1EN              (1u)           /*!<  Sustain GPIO Output Select  - AD242X only*/
#define A2B_BITP_GPIODEN_IOD0EN              (0u)           /*!<  Sustain GPIO Output Select  - AD242X only*/

