Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODEN                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIODEN_IOD7EN           (0x00000080u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODEN_IOD6EN           (0x00000040u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODEN_IOD5EN           (0x00000020u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODEN_IOD4EN           (0x00000010u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODEN_IOD3EN           (0x00000008u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODEN_IOD2EN           (0x00000004u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODEN_IOD1EN           (0x00000002u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODEN_IOD0EN           (0x00000001u)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODEN                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_GPIODEN_IOD7EN_EN        (0x00000080u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD7EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD6EN_EN        (0x00000040u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD6EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD5EN_EN        (0x00000020u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD5EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD4EN_EN        (0x00000010u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD4EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD3EN_EN        (0x00000008u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD3EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD2EN_EN        (0x00000004u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD2EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD1EN_EN        (0x00000002u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD1EN_DIS       (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD0EN_EN        (0x00000001u)  /*!<  AD242X only */
#define A2B_ENUM_GPIODEN_IOD0EN_DIS       (0x00000000u)  /*!<  AD242X only */

#define A2B_REG_GPIODEN_RESET             (0x00000000u)  /*!<  Reset Value for GPIODEN */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD0MSK                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOD0MSK_IOD0MSK           (0u)           /*!<  GPIO Over Distance IO0 Mask  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD0MSK                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOD0MSK_IOD0MSK        (0x000000FFu)     /*!<  AD242X only*/

#define A2B_REG_GPIOD0MSK_RESET           (0x00000000u)     /*!<  Reset Value for GPIOD0MSK */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD1MSK                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOD1MSK_IOD0MSK           (0u)           /*!<  GPIO Over Distance IO1 Mask  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD1MSK                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOD1MSK_IOD0MSK        (0x000000FFu)     /*!<  AD242X only*/

#define A2B_REG_GPIOD1MSK_RESET           (0x00000000u)     /*!<  Reset Value for GPIOD1MSK */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD2MSK                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOD2MSK_IOD0MSK           (0u)           /*!<  GPIO Over Distance IO2 Mask  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD2MSK                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOD2MSK_IOD0MSK        (0x000000FFu)     /*!<  AD242X only*/

#define A2B_REG_GPIOD2MSK_RESET           (0x00000000u)     /*!<  Reset Value for GPIOD2MSK */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD3MSK                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOD3MSK_IOD0MSK           (0u)           /*!<  GPIO Over Distance IO3 Mask  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD3MSK                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOD3MSK_IOD0MSK        (0x000000FFu)     /*!<  AD242X only*/

#define A2B_REG_GPIOD3MSK_RESET           (0x00000000u)     /*!<  Reset Value for GPIOD3MSK */

