Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD4MSK                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOD4MSK_IOD0MSK           (0u)           /*!<  GPIO Over Distance IO4 Mask  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD4MSK                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOD4MSK_IOD0MSK        (0x000000FFu)     /*!<  AD242X only*/

#define A2B_REG_GPIOD4MSK_RESET           (0x00000000u)     /*!<  Reset Value for GPIOD4MSK */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD5MSK                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOD5MSK_IOD0MSK           (0u)           /*!<  GPIO Over Distance IO5 Mask  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD5MSK                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOD5MSK_IOD0MSK        (0x000000FFu)     /*!<  AD242X only*/

#define A2B_REG_GPIOD5MSK_RESET           (0x00000000u)     /*!<  Reset Value for GPIOD5MSK */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD6MSK                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOD6MSK_IOD0MSK           (0u)           /*!<  GPIO Over Distance IO6 Mask  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD6MSK                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOD6MSK_IOD0MSK        (0x000000FFu)     /*!<  AD242X only*/

#define A2B_REG_GPIOD6MSK_RESET           (0x00000000u)     /*!<  Reset Value for GPIOD6MSK */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD7MSK                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOD7MSK_IOD0MSK           (0u)           /*!<  GPIO Over Distance IO7 Mask  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOD7MSK                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOD7MSK_IOD0MSK        (0x000000FFu)     /*!<  AD242X only*/

#define A2B_REG_GPIOD7MSK_RESET           (0x00000000u)     /*!<  Reset Value for GPIOD7MSK */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODDAT                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIODDAT_IOD7DAT             (7u)           /*!<  Bus GPIO Port Bit 7 Value  - AD242X only*/
#define A2B_BITP_GPIODDAT_IOD6DAT             (6u)           /*!<  Bus GPIO Port Bit 6 Value  - AD242X only*/
#define A2B_BITP_GPIODDAT_IOD5DAT             (5u)           /*!<  Bus GPIO Port Bit 5 Value  - AD242X only*/
#define A2B_BITP_GPIODDAT_IOD4DAT             (4u)           /*!<  Bus GPIO Port Bit 4 Value  - AD242X only*/
#define A2B_BITP_GPIODDAT_IOD3DAT             (3u)           /*!<  Bus GPIO Port Bit 3 Value  - AD242X only*/
#define A2B_BITP_GPIODDAT_IOD2DAT             (2u)           /*!<  Bus GPIO Port Bit 2 Value  - AD242X only*/
#define A2B_BITP_GPIODDAT_IOD1DAT             (1u)           /*!<  Bus GPIO Port Bit 1 Value  - AD242X only*/
#define A2B_BITP_GPIODDAT_IOD0DAT             (0u)           /*!<  Bus GPIO Port Bit 0 Value  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODDAT                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIODDAT_IOD7DAT          (0x00000080u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODDAT_IOD6DAT          (0x00000040u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODDAT_IOD5DAT          (0x00000020u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODDAT_IOD4DAT          (0x00000010u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODDAT_IOD3DAT          (0x00000008u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODDAT_IOD2DAT          (0x00000004u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODDAT_IOD1DAT          (0x00000002u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODDAT_IOD0DAT          (0x00000001u)     /*!<  AD242X only*/

#define A2B_REG_GPIODDAT_RESET             (0x00000000u)     /*!<  Reset Value for GPIODDAT */

