Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODINV                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIODINV_IOD7INV             (7u)           /*!<  GPIO Over Distance IO7 Invert  - AD242X only*/
#define A2B_BITP_GPIODINV_IOD6INV             (6u)           /*!<  GPIO Over Distance IO6 Invert  - AD242X only*/
#define A2B_BITP_GPIODINV_IOD5INV             (5u)           /*!<  GPIO Over Distance IO5 Invert  - AD242X only*/
#define A2B_BITP_GPIODINV_IOD4INV             (4u)           /*!<  GPIO Over Distance IO4 Invert  - AD242X only*/
#define A2B_BITP_GPIODINV_IOD3INV             (3u)           /*!<  GPIO Over Distance IO3 Invert  - AD242X only*/
#define A2B_BITP_GPIODINV_IOD2INV             (2u)           /*!<  GPIO Over Distance IO2 Invert  - AD242X only*/
#define A2B_BITP_GPIODINV_IOD1INV             (1u)           /*!<  GPIO Over Distance IO1 Invert  - AD242X only*/
#define A2B_BITP_GPIODINV_IOD0INV             (0u)           /*!<  GPIO Over Distance IO0 Invert  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODINV                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIODINV_IOD7INV          (0x00000080u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODINV_IOD6INV          (0x00000040u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODINV_IOD5INV          (0x00000020u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODINV_IOD4INV          (0x00000010u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODINV_IOD3INV          (0x00000008u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODINV_IOD2INV          (0x00000004u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODINV_IOD1INV          (0x00000002u)     /*!<  AD242X only*/
#define A2B_BITM_GPIODINV_IOD0INV          (0x00000001u)     /*!<  AD242X only*/

#define A2B_REG_GPIODINV_RESET             (0x00000000u)     /*!<  Reset Value for GPIODINV */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0CTL                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX0CTL_MB0LEN              (4u)           /*!<  Mailbox 0 Length  - AD242X only*/
#define A2B_BITP_MBOX0CTL_MB0FIEN             (3u)           /*!<  Mailbox 0 Full Interrupt Enable  - AD242X only*/
#define A2B_BITP_MBOX0CTL_MB0EIEN             (2u)           /*!<  Mailbox 0 Empty Interrupt Enable  - AD242X only*/
#define A2B_BITP_MBOX0CTL_MB0DIR              (1u)           /*!<  Mailbox 0 Direction  - AD242X only*/
#define A2B_BITP_MBOX0CTL_MB0EN               (0u)           /*!<  Mailbox 0 Enable  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0CTL                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX0CTL_MB0LEN           (0x00000030u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX0CTL_MB0FIEN          (0x00000008u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX0CTL_MB0EIEN          (0x00000004u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX0CTL_MB0DIR           (0x00000002u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX0CTL_MB0EN            (0x00000001u)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0CTL                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_MBOX0CTL_MB0LEN_1_BYTE    (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0CTL_MB0LEN_2_BYTE    (0x00000010u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0CTL_MB0LEN_3_BYTE    (0x00000020u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0CTL_MB0LEN_4_BYTE    (0x00000030u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX0CTL_MB0FIEN_DIS      (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0CTL_MB0FIEN_EN       (0x00000008u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX0CTL_MB0EIEN_DIS      (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0CTL_MB0EIEN_EN       (0x00000004u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX0CTL_MB0DIR_TX        (0x00000002u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0CTL_MB0DIR_RX        (0x00000000u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX0CTL_MB0EN_DIS        (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0CTL_MB0EN_EN         (0x00000001u)  /*!<  AD242X only */

#define A2B_REG_MBOX0CTL_RESET             (0x00000000u)  /*!<  Reset Value for MBOX0CTL */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0STAT                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX0STAT_MB0EIRQ             (5u)       /*!<  Mailbox 0 Signaling Empty IRQ  - AD242X only*/
#define A2B_BITP_MBOX0STAT_MB0FIRQ             (4u)       /*!<  Mailbox 0 Signaling Full IRQ  - AD242X only*/
#define A2B_BITP_MBOX0STAT_MB0EMPTY            (1u)       /*!<  Mailbox 0 Empty  - AD242X only*/
#define A2B_BITP_MBOX0STAT_MB0FULL             (0u)       /*!<  Mailbox 0 Full  - AD242X only*/

