Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0STAT                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX0STAT_MB0EIRQ        (0x00000020u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX0STAT_MB0FIRQ        (0x00000010u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX0STAT_MB0EMPTY       (0x00000002u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX0STAT_MB0FULL        (0x00000001u)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0STAT                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_MBOX0STAT_MB0EIRQ_ACT    (0x00000020u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0STAT_MB0EIRQ_INACT  (0x00000000u)  /*!<  AD242X only */


#define A2B_ENUM_MBOX0STAT_MB0FIRQ_ACT    (0x00000010u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0STAT_MB0FIRQ_INACT  (0x00000000u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX0STAT_MB0EMPTY_INACT (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0STAT_MB0EMPTY_ACT   (0x00000002u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX0STAT_MB0FULL_INACT  (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX0STAT_MB0FULL_ACT    (0x00000001u)  /*!<  AD242X only */

#define A2B_REG_MBOX0STAT_RESET           (0x00000002u)  /*!<  Reset Value for MBOX0STAT */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0B0                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX0B0_MBOX0              (0u)           /*!<  Mailbox 0 Data Byte 1  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0B0                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX0B0_MBOX0            (0x000000FFu)    /*!<  AD242X only*/

#define A2B_REG_MBOX0B0_RESET             (0x00000000u)    /*!<  Reset Value for MBOX0B0 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0B1                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX0B1_MBOX0              (0u)           /*!<  Mailbox 1 Data Byte 1  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0B1                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX0B1_MBOX0            (0x000000FFu)    /*!<  AD242X only*/

#define A2B_REG_MBOX0B1_RESET             (0x00000000u)    /*!<  Reset Value for MBOX0B1 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0B2                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX0B2_MBOX0              (0u)           /*!<  Mailbox 2 Data Byte 1  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0B2                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX0B2_MBOX0            (0x000000FFu)    /*!<  AD242X only*/

#define A2B_REG_MBOX0B2_RESET             (0x00000000u)    /*!<  Reset Value for MBOX0B2 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0B3                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX0B3_MBOX0              (0u)           /*!<  Mailbox 3 Data Byte 1  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX0B3                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX0B3_MBOX0            (0x000000FFu)    /*!<  AD242X only*/

#define A2B_REG_MBOX0B3_RESET             (0x00000000u)    /*!<  Reset Value for MBOX0B3 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1CTL                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX1CTL_MB1LEN              (4u)           /*!<  Mailbox 1 Length  - AD242X only*/
#define A2B_BITP_MBOX1CTL_MB1FIEN             (3u)           /*!<  Mailbox 1 Full Interrupt Enable  - AD242X only*/
#define A2B_BITP_MBOX1CTL_MB1EIEN             (2u)           /*!<  Mailbox 1 Empty Interrupt Enable  - AD242X only*/
#define A2B_BITP_MBOX1CTL_MB1DIR              (1u)           /*!<  Mailbox 1 Direction  - AD242X only*/
#define A2B_BITP_MBOX1CTL_MB1EN               (0u)           /*!<  Mailbox 1 Enable  - AD242X only*/

