Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1CTL                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX1CTL_MB1LEN           (0x00000030u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX1CTL_MB1FIEN          (0x00000008u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX1CTL_MB1EIEN          (0x00000004u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX1CTL_MB1DIR           (0x00000002u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX1CTL_MB1EN            (0x00000001u)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1CTL                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_MBOX1CTL_MB1LEN_1_BYTE    (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1CTL_MB1LEN_2_BYTE    (0x00000010u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1CTL_MB1LEN_3_BYTE    (0x00000020u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1CTL_MB1LEN_4_BYTE    (0x00000030u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX1CTL_MB1FIEN_DIS      (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1CTL_MB1FIEN_EN       (0x00000008u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX1CTL_MB1EIEN_DIS      (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1CTL_MB1EIEN_EN       (0x00000004u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX1CTL_MB1DIR_TX        (0x00000002u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1CTL_MB1DIR_RX        (0x00000000u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX1CTL_MB1EN_DIS        (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1CTL_MB1EN_EN         (0x00000001u)  /*!<  AD242X only */

#define A2B_REG_MBOX1CTL_RESET             (0x00000000u)  /*!<  Reset Value for MBOX1CTL */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1STAT                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX1STAT_MB1EIRQ             (5u)       /*!<  Mailbox 1 Signaling Empty IRQ  - AD242X only*/
#define A2B_BITP_MBOX1STAT_MB1FIRQ             (4u)       /*!<  Mailbox 1 Signaling Full IRQ  - AD242X only*/
#define A2B_BITP_MBOX1STAT_MB1EMPTY            (1u)       /*!<  Mailbox 1 Empty  - AD242X only*/
#define A2B_BITP_MBOX1STAT_MB1FULL             (0u)       /*!<  Mailbox 1 Full  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1STAT                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX1STAT_MB1EIRQ        (0x00000020u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX1STAT_MB1FIRQ        (0x00000010u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX1STAT_MB1EMPTY       (0x00000002u)     /*!<  AD242X only*/
#define A2B_BITM_MBOX1STAT_MB1FULL        (0x00000001u)     /*!<  AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1STAT                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_MBOX1STAT_MB1EIRQ_ACT    (0x00000020u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1STAT_MB1EIRQ_INACT  (0x00000000u)  /*!<  AD242X only */


#define A2B_ENUM_MBOX1STAT_MB1FIRQ_ACT    (0x00000010u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1STAT_MB1FIRQ_INACT  (0x00000000u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX1STAT_MB1EMPTY_INACT (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1STAT_MB1EMPTY_ACT   (0x00000002u)  /*!<  AD242X only */

#define A2B_ENUM_MBOX1STAT_MB1FULL_INACT  (0x00000000u)  /*!<  AD242X only */
#define A2B_ENUM_MBOX1STAT_MB1FULL_ACT    (0x00000001u)  /*!<  AD242X only */

#define A2B_REG_MBOX1STAT_RESET           (0x00000002u)  /*!<  Reset Value for MBOX1STAT */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1B0                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX1B0_MBOX1              (0u)           /*!<  Mailbox 1 Data Byte 1  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1B0                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX1B0_MBOX1            (0x000000FFu)    /*!<  AD242X only*/

#define A2B_REG_MBOX1B0_RESET             (0x00000000u)    /*!<  Reset Value for MBOX1B0 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1B1                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX1B1_MBOX1              (0u)           /*!<  Mailbox 1 Data Byte 1  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1B1                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX1B1_MBOX1            (0x000000FFu)    /*!<  AD242X only*/

#define A2B_REG_MBOX1B1_RESET             (0x00000000u)    /*!<  Reset Value for MBOX1B1 */

