Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1B2                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX1B2_MBOX1              (0u)           /*!<  Mailbox 2 Data Byte 1  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1B2                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX1B2_MBOX1            (0x000000FFu)    /*!<  AD242X only*/

#define A2B_REG_MBOX1B2_RESET             (0x00000000u)    /*!<  Reset Value for MBOX1B2 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1B3                            Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_MBOX1B3_MBOX1              (0u)           /*!<  Mailbox 3 Data Byte 1  - AD242X only*/

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        MBOX1B3                            Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_MBOX1B3_MBOX1            (0x000000FFu)    /*!<  AD242X only*/

#define A2B_REG_MBOX1B3_RESET             (0x00000000u)    /*!<  Reset Value for MBOX1B3 */

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2STXOFFSET                          Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2STXOFFSET_TSBEFORE        (7u)           /*!<  Three-State before TX Slots */
#define A2B_BITP_I2STXOFFSET_TSAFTER         (6u)           /*!<  Three-State after TX Slots */
#define A2B_BITP_I2STXOFFSET_TXOFFSET        (0u)           /*!<  Serial TX Offset */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2STXOFFSET                          Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2STXOFFSET_TSBEFORE        (0x00000080u)
#define A2B_BITM_I2STXOFFSET_TSAFTER         (0x00000040u)
#define A2B_BITM_I2STXOFFSET_TXOFFSET        (0x0000003Fu)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2STXOFFSET                          Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_I2STXOFFSET_TSBEFORE_EN     (0x00000080u)  /*!<  Enable */
#define A2B_ENUM_I2STXOFFSET_TSBEFORE_DIS    (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_I2STXOFFSET_TSAFTER_EN      (0x00000040u)  /*!<  Enable */
#define A2B_ENUM_I2STXOFFSET_TSAFTER_DIS     (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_I2STXOFFSET_TXOFFSET_01     (0x00000001u)  /*!<  TX Offset of 1 TDM Slot */
#define A2B_ENUM_I2STXOFFSET_TXOFFSET_63     (0x0000003Fu)  /*!<  TX Offset of 63 TDM Slots */
#define A2B_ENUM_I2STXOFFSET_TXOFFSET_00     (0x00000000u)  /*!<  No TX Offset */
#define A2B_ENUM_I2STXOFFSET_TXOFFSET_62     (0x0000003Eu)  /*!<  TX Offset of 62 TDM Slots */

#define A2B_REG_I2STXOFFSET_RESET            (0x00000000u)  /*!<  Reset Value for I2STXOFFSET */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRXOFFSET                          Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2SRXOFFSET_RXOFFSET        (0u)           /*!<  Serial RX Offset */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRXOFFSET                          Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2SRXOFFSET_RXOFFSET        (0x0000003Fu)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2SRXOFFSET                          Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_I2SRXOFFSET_00              (0x00000000u)  /*!<  No RX Offset */
#define A2B_ENUM_I2SRXOFFSET_62              (0x0000001Eu)  /*!<  62 TDM Slot Offset */
#define A2B_ENUM_I2SRXOFFSET_63              (0x0000001Fu)  /*!<  63 TDM Slot Offset */

#define A2B_REG_I2SRXOFFSET_RESET            (0x00000000u)  /*!<  Reset Value for I2SRXOFFSET */
#define A2B_REG_SYNCOFFSET_RESET             (0x00000000u)  /*!<  Reset Value for SYNCOFFSET */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PDMCTL                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_PDMCTL_PDMRATE              (5u)           /*!<  Highpass Filter Cutoff - AD242X only*/
#define A2B_BITP_PDMCTL_HPFCUTOFF            (5u)           /*!<  Highpass Filter Cutoff - AD241x only*/
#define A2B_BITP_PDMCTL_HPFEN                (4u)           /*!<  Highpass Filter Enable */
#define A2B_BITP_PDMCTL_PDM1SLOTS            (3u)           /*!<  PDM1 Slots */
#define A2B_BITP_PDMCTL_PDM1EN               (2u)           /*!<  PDM1 Enable */
#define A2B_BITP_PDMCTL_PDM0SLOTS            (1u)           /*!<  PDM0 Slots */
#define A2B_BITP_PDMCTL_PDM0EN               (0u)           /*!<  PDM0 Enable */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PDMCTL                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_PDMCTL_PDMRATE              (0x00000060u)  /*!<  AD242X only */
#define A2B_BITM_PDMCTL_HPFCUTOFF            (0x000000E0u)
#define A2B_BITM_PDMCTL_HPFEN                (0x00000010u)
#define A2B_BITM_PDMCTL_PDM1SLOTS            (0x00000008u)
#define A2B_BITM_PDMCTL_PDM1EN               (0x00000004u)
#define A2B_BITM_PDMCTL_PDM0SLOTS            (0x00000002u)
#define A2B_BITM_PDMCTL_PDM0EN               (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PDMCTL                               Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_PDMCTL_SFR_1X               (0x00000000u)  /*!< PDM samples produced at Superframe rate - AD242X only */
#define A2B_ENUM_PDMCTL_SFR_DIV2             (0x00000020u)  /*!< PDM samples produced at 1/2 Superframe rate - AD242X only */
#define A2B_ENUM_PDMCTL_SFR_DIV4             (0x00000040u)  /*!< PDM samples produced at 1/4 Superframe rate - AD242X only */
#define A2B_ENUM_PDMCTL_0_93                 (0x000000C0u)  /*!<  0.93 Hz */
#define A2B_ENUM_PDMCTL_3_73                 (0x00000080u)  /*!<  3.73 Hz */
#define A2B_ENUM_PDMCTL_29_8                 (0x00000020u)  /*!<  29.8 Hz */
#define A2B_ENUM_PDMCTL_7_46                 (0x00000060u)  /*!<  7.46 Hz */
#define A2B_ENUM_PDMCTL_59_9                 (0x00000000u)  /*!<  59.9 Hz */
#define A2B_ENUM_PDMCTL_14_9                 (0x00000040u)  /*!<  14.9 Hz */
#define A2B_ENUM_PDMCTL_1_86                 (0x000000A0u)  /*!<  1.86 Hz */
#define A2B_ENUM_PDMCTL_HPFEN_EN             (0x00000010u)  /*!<  Enable Filter */
#define A2B_ENUM_PDMCTL_HPFEN_DIS            (0x00000000u)  /*!<  Disable Filter */
#define A2B_ENUM_PDMCTL_PDM1SLOTS_2          (0x00000008u)  /*!<  2 Slots */
#define A2B_ENUM_PDMCTL_PDM1SLOTS_1          (0x00000000u)  /*!<  1 Slot */
#define A2B_ENUM_PDMCTL_PDM1EN_EN            (0x00000004u)  /*!<  Enable PDM reception on the pin */
#define A2B_ENUM_PDMCTL_PDM1EN_DIS           (0x00000000u)  /*!<  Disable PDM reception on the pin. */
#define A2B_ENUM_PDMCTL_PDM0SLOTS_2          (0x00000002u)  /*!<  2 Slots */
#define A2B_ENUM_PDMCTL_PDM0SLOTS_1          (0x00000000u)  /*!<  1 Slot */
#define A2B_ENUM_PDMCTL_PDM0EN_EN            (0x00000001u)  /*!<  Enable PDM reception on the pin */
#define A2B_ENUM_PDMCTL_PDM0EN_DIS           (0x00000000u)  /*!<  Disable PDM reception on the pin */

#define A2B_REG_PDMCTL_RESET                 (0x00000000u)  /*!<  Reset Value for PDMCTL */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        ERRMGMT                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_ERRMGMT_ERRSLOT             (2u)           /*!<  Add Error Indicating Channel to I2S/TDM Output */
#define A2B_BITP_ERRMGMT_ERRSIG              (1u)           /*!<  Show Data Error on Remaining Bits */
#define A2B_BITP_ERRMGMT_ERRLSB              (0u)           /*!<  Show Data Error on LSB */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        ERRMGMT                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_ERRMGMT_ERRSLOT             (0x00000004u)
#define A2B_BITM_ERRMGMT_ERRSIG              (0x00000002u)
#define A2B_BITM_ERRMGMT_ERRLSB              (0x00000001u)

#define A2B_REG_ERRMGMT_RESET                (0x00000000u)  /*!<  Reset Value for ERRMGMT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2STEST                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_I2STEST_BUSLOOPBK           (4u)           /*!<  Bus Loopback - AD242X only */
#define A2B_BITP_I2STEST_SELRX1              (3u)           /*!<  Select RX1 Block to Loopback Buffer */
#define A2B_BITP_I2STEST_RX2LOOPBK           (2u)           /*!<  RX Block to Loopback Buffer */
#define A2B_BITP_I2STEST_LOOPBK2TX           (1u)           /*!<  Loopback Data to TX Blocks */
#define A2B_BITP_I2STEST_PATTRN2TX           (0u)           /*!<  Default Bit Pattern to Serial TX Blocks */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        I2STEST                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_I2STEST_BUSLOOPBK           (0x00000010u)  /*!< AD242X only */
#define A2B_BITM_I2STEST_SELRX1              (0x00000008u)
#define A2B_BITM_I2STEST_RX2LOOPBK           (0x00000004u)
#define A2B_BITM_I2STEST_LOOPBK2TX           (0x00000002u)
#define A2B_BITM_I2STEST_PATTRN2TX           (0x00000001u)

#define A2B_REG_I2STEST_RESET                (0x00000000u)  /*!<  Reset Value for I2STEST */
/* ============================================================================================================================ */
/** \name   ID Register Field Definitions */
/* ============================================================================================================================ */
#define A2B_REG_VENDOR_RESET                (0x000000ADu)   /*!<  Reset Value for VENDOR */
#define A2B_REG_PRODUCT_RESET_24XX          (0x00000010u)   /*!<  Reset Value for PRODUCT */
#define A2B_REG_VERSION_RESET_24XX          (0x00000010u)   /*!<  Reset Value for VERSION */
#define A2B_REG_PRODUCT_RESET_242X          (0x00000025u)   /*!<  Reset Value for PRODUCT */
#define A2B_REG_VERSION_RESET_242X          (0x00000000u)   /*!<  Reset Value for VERSION */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CAPABILITY                           Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CAPABILITY_MINFO            (7u)           /*!<  On-Chip Module Info Available */
#define A2B_BITP_CAPABILITY_SPIAVAIL         (1u)           /*!<  Module Info Available over SPI */
#define A2B_BITP_CAPABILITY_I2CAVAIL         (0u)           /*!<  I2C Interface Available */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CAPABILITY                           Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_CAPABILITY_MINFO            (0x00000080u)
#define A2B_BITM_CAPABILITY_SPIAVAIL         (0x00000002u)
#define A2B_BITM_CAPABILITY_I2CAVAIL         (0x00000001u)

#define A2B_REG_CAPABILITY_RESET             (0x00000001u)  /*!<  Reset Value for CAPABILITY */
/* ============================================================================================================================ */
/** \name   Interrupt and Error Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTSTAT                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_INTSTAT_IRQ                 (0u)           /*!<  Interrupt Currently Asserted */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTSTAT                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_INTSTAT_IRQ                 (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTSTAT                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_INTSTAT_IRQ_HIGH            (0x00000001u)  /*!<  Interrupt request */
#define A2B_ENUM_INTSTAT_IRQ_LOW             (0x00000000u)  /*!<  No Interrupt request */

#define A2B_REG_INTSTAT_RESET                (0x00000000u)  /*!<  Reset Value for INTSTAT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTSRC                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_INTSRC_MSTINT               (7u)           /*!<  Master Interrupt */
#define A2B_BITP_INTSRC_SLVINT               (6u)           /*!<  Slave Interrupt */
#define A2B_BITP_INTSRC_INODE                (0u)           /*!<  ID for SLVINT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTSRC                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_INTSRC_MSTINT               (0x00000080u)
#define A2B_BITM_INTSRC_SLVINT               (0x00000040u)
#define A2B_BITM_INTSRC_INODE                (0x0000000Fu)

#define A2B_REG_INTSRC_RESET                 (0x00000000u)  /*!<  Reset Value for INTSRC */
#define A2B_REG_INTTYPE_RESET                (0x00000000u)  /*!<  Reset Value for INTTYPE */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTTYPE                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_INTTYPE_HDCNTERR             (0u)          /*!< HDCNTERR */
#define A2B_ENUM_INTTYPE_DDERR                (1u)          /*!< DDERR */
#define A2B_ENUM_INTTYPE_CRCERR               (2u)          /*!< CRCERR */
#define A2B_ENUM_INTTYPE_DPERR                (3u)          /*!< DPERR */
#define A2B_ENUM_INTTYPE_BECOVF               (4u)          /*!< BECOVF */
#define A2B_ENUM_INTTYPE_SRFERR               (5u)          /*!< SRFERR */
#define A2B_ENUM_INTTYPE_PWRERR_CS_GND        (9u)          /*!< PWRERR (Cable Shorted to GND) */
#define A2B_ENUM_INTTYPE_PWRERR_CS_VBAT       (10u)         /*!< PWRERR (Cable Shorted to VBat) */
#define A2B_ENUM_INTTYPE_PWRERR_CS            (11u)         /*!< PWRERR (Cable Shorted Together) */
#define A2B_ENUM_INTTYPE_PWRERR_CDISC         (12u)         /*!< PWRERR (Cable Disconnected or Open Circuit) */
#define A2B_ENUM_INTTYPE_PWRERR_CREV          (13u)         /*!< PWRERR (Cable Reverse Connected) */
#define A2B_ENUM_INTTYPE_PWRERR_FAULT         (15u)         /*!< PWRERR (Indeterminate Fault) */
#define A2B_ENUM_INTTYPE_IO0PND               (16u)         /*!< IO0PND - Slave Only */
#define A2B_ENUM_INTTYPE_IO1PND               (17u)         /*!< IO1PND - Slave Only */
#define A2B_ENUM_INTTYPE_IO2PND               (18u)         /*!< IO2PND - Slave Only */
#define A2B_ENUM_INTTYPE_IO3PND               (19u)         /*!< IO3PND */
#define A2B_ENUM_INTTYPE_IO4PND               (20u)         /*!< IO4PND */
#define A2B_ENUM_INTTYPE_IO5PND               (21u)         /*!< IO5PND */
#define A2B_ENUM_INTTYPE_IO6PND               (22u)         /*!< IO6PND */
#define A2B_ENUM_INTTYPE_IO7PND               (23u)         /*!< IO7PND */
#define A2B_ENUM_INTTYPE_DSCDONE              (24u)         /*!< DSCDONE - Master Only */
#define A2B_ENUM_INTTYPE_I2CERR               (25u)         /*!< I2CERR - Master Only */
#define A2B_ENUM_INTTYPE_ICRCERR              (26u)         /*!< ICRCERR - Master Only */
#define A2B_ENUM_INTTYPE_PWRERR_NLS_GND       (41u)         /*!< PWRERR - Non-Localized Short to GND */
#define A2B_ENUM_INTTYPE_PWRERR_NLS_VBAT      (42u)         /*!< PWRERR - Non-Localized Short to VBat */
#define A2B_ENUM_INTTYPE_IRPT_MSG_ERR		  (128u)		   /*!< PWRERR - Interrupt Messaging Error */
#define A2B_ENUM_INTTYPE_STRTUP_ERR_RTF		  (252u)		   /*!< Startup Error - Return to Factory */
#define A2B_ENUM_INTTYPE_SLAVE_INTTYPE_ERR    (253u)        /*!< Slave INTTYPE Read Error - Master Only */
#define A2B_ENUM_INTTYPE_STANDBY_DONE         (254u)        /*!< Standby Done - Master Only */
#define A2B_ENUM_INTTYPE_MSTR_RUNNING         (255u)        /*!< MSTR_RUNNING - Master Only */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTPND0                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_INTPND0_SRFCRCERR           (7u)           /*!<  SRF CRC Error - AD242X slave only */
#define A2B_BITP_INTPND0_SRFERR              (6u)           /*!<  Missed SRF */
#define A2B_BITP_INTPND0_BECOVF              (5u)           /*!<  Bit Error Count error */
#define A2B_BITP_INTPND0_PWRERR              (4u)           /*!<  Switch reporting error on downstream power */
#define A2B_BITP_INTPND0_DPERR               (3u)           /*!<  Data Parity Error */
#define A2B_BITP_INTPND0_CRCERR              (2u)           /*!<  CRC Error */
#define A2B_BITP_INTPND0_DDERR               (1u)           /*!<  Data Decoding Error */
#define A2B_BITP_INTPND0_HDCNTERR            (0u)           /*!<  Header Count Error */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTPND0                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_INTPND0_SRFCRCERR           (0x00000080u)
#define A2B_BITM_INTPND0_SRFERR              (0x00000040u)
#define A2B_BITM_INTPND0_BECOVF              (0x00000020u)
#define A2B_BITM_INTPND0_PWRERR              (0x00000010u)
#define A2B_BITM_INTPND0_DPERR               (0x00000008u)
#define A2B_BITM_INTPND0_CRCERR              (0x00000004u)
#define A2B_BITM_INTPND0_DDERR               (0x00000002u)
#define A2B_BITM_INTPND0_HDCNTERR            (0x00000001u)

