Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
#define A2B_REG_INTPND0_RESET                (0x00000000u)  /*!<  Reset Value for INTPND0 */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTPND1                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_INTPND1_IO7PND              (7u)           /*!<  IO7 Int Pending - AD242X only */
#define A2B_BITP_INTPND1_IO6PND              (6u)           /*!<  IO6 Int Pending */
#define A2B_BITP_INTPND1_IO5PND              (5u)           /*!<  IO5 Int Pending */
#define A2B_BITP_INTPND1_IO4PND              (4u)           /*!<  IO4 Int Pending */
#define A2B_BITP_INTPND1_IO3PND              (3u)           /*!<  IO3 Int Pending */
#define A2B_BITP_INTPND1_IO2PND              (2u)           /*!<  IO2 Int Pending */
#define A2B_BITP_INTPND1_IO1PND              (1u)           /*!<  IO1 Int Pending */
#define A2B_BITP_INTPND1_IO0PND              (0u)           /*!<  IO0 Int Pending (Slave Only) */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTPND1                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_INTPND1_IO7PND              (0x00000080u)
#define A2B_BITM_INTPND1_IO6PND              (0x00000040u)
#define A2B_BITM_INTPND1_IO5PND              (0x00000020u)
#define A2B_BITM_INTPND1_IO4PND              (0x00000010u)
#define A2B_BITM_INTPND1_IO3PND              (0x00000008u)
#define A2B_BITM_INTPND1_IO2PND              (0x00000004u)
#define A2B_BITM_INTPND1_IO1PND              (0x00000002u)
#define A2B_BITM_INTPND1_IO0PND              (0x00000001u)

#define A2B_REG_INTPND1_RESET                (0x00000000u)   /*!<  Reset Value for INTPND1 */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTPND2                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_INTPND2_SLVIRQ              (3u)           /*!<  Slave Interrupt Received Master Only */
#define A2B_BITP_INTPND2_ICRCERR             (2u)           /*!<  Int Frame CRC Error Master Only */
#define A2B_BITP_INTPND2_I2CERR              (1u)           /*!<  I2C Transaction Error Master Only */
#define A2B_BITP_INTPND2_DSCDONE             (0u)           /*!<  Node Discovered Master Only */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTPND2                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_INTPND2_SLVIRQ              (0x00000008u)
#define A2B_BITM_INTPND2_ICRCERR             (0x00000004u)
#define A2B_BITM_INTPND2_I2CERR              (0x00000002u)
#define A2B_BITM_INTPND2_DSCDONE             (0x00000001u)

/* ------------------------------------------------------------------------------------------------------------------------- */
/*        INTMSK2                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_INTMSK2_SLVIRQ              (0x00000008u)
#define A2B_BITM_INTMSK2_ICRCERR             (0x00000004u)
#define A2B_BITM_INTMSK2_I2CERR              (0x00000002u)
#define A2B_BITM_INTMSK2_DSCDONE             (0x00000001u)

#define A2B_BITM_INTMSK1_IO6PND              (0x00000040u)
#define A2B_BITM_INTMSK1_IO5PND              (0x00000020u)
#define A2B_BITM_INTMSK1_IO4PND              (0x00000010u)
#define A2B_BITM_INTMSK1_IO3PND              (0x00000008u)
#define A2B_BITM_INTMSK1_IO2PND              (0x00000004u)
#define A2B_BITM_INTMSK1_IO1PND              (0x00000002u)
#define A2B_BITM_INTMSK1_IO0PND              (0x00000001u)

#define A2B_REG_INTPND2_RESET                (0x00000000u)   /*!<  Reset Value for INTPND2 */
#define A2B_REG_INTMSK0_RESET                (0x00000000u)   /*!<  Reset Value for INTMSK0 */
#define A2B_REG_INTMSK1_RESET                (0x00000000u)   /*!<  Reset Value for INTMSK1 */
#define A2B_REG_INTMSK2_RESET                (0x00000000u)   /*!<  Reset Value for INTMSK2 */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        BECCTL                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_BECCTL_THRESHLD             (5u)           /*!<  Threshold to Generate an Interrupt */
#define A2B_BITP_BECCTL_ENICRC               (4u)           /*!<  Enable ICRCERR count */
#define A2B_BITP_BECCTL_ENDP                 (3u)           /*!<  Enable DPERR count */
#define A2B_BITP_BECCTL_ENCRC                (2u)           /*!<  Enable CRCERR count */
#define A2B_BITP_BECCTL_ENDD                 (1u)           /*!<  Enable DDERR count */
#define A2B_BITP_BECCTL_ENHDCNT              (0u)           /*!<  Enable HDCNTERR count */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        BECCTL                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_BECCTL_THRESHLD             (0x000000E0u)
#define A2B_BITM_BECCTL_ENICRC               (0x00000010u)
#define A2B_BITM_BECCTL_ENDP                 (0x00000008u)
#define A2B_BITM_BECCTL_ENCRC                (0x00000004u)
#define A2B_BITM_BECCTL_ENDD                 (0x00000002u)
#define A2B_BITM_BECCTL_ENHDCNT              (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        BECCTL                               Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_BECCTL_THRESHLD_128         (0x000000C0u)  /*!<  Interrupt After 128 Errors */
#define A2B_ENUM_BECCTL_THRESHLD_32          (0x00000080u)  /*!<  Interrupt After 32 Errors */
#define A2B_ENUM_BECCTL_THRESHLD_4           (0x00000020u)  /*!<  Interrupt After 4 Errors */
#define A2B_ENUM_BECCTL_THRESHLD_16          (0x00000060u)  /*!<  Interrupt After 16 Errors */
#define A2B_ENUM_BECCTL_THRESHLD_2           (0x00000000u)  /*!<  Interrupt After 2 Errors */
#define A2B_ENUM_BECCTL_THRESHLD_256         (0x000000E0u)  /*!<  Interrupt After 256 Errors */
#define A2B_ENUM_BECCTL_THRESHLD_8           (0x00000040u)  /*!<  Interrupt After 8 Errors */
#define A2B_ENUM_BECCTL_THRESHLD_64          (0x000000A0u)  /*!<  Interrupt After 64 Errors */
#define A2B_ENUM_BECCTL_ENICRC_EN            (0x00000010u)  /*!<  Enable Bit Error Counting */
#define A2B_ENUM_BECCTL_ENICRC_DIS           (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_BECCTL_ENDP_EN              (0x00000008u)  /*!<  Parity Error */
#define A2B_ENUM_BECCTL_ENDP_DIS             (0x00000000u)  /*!<  No Parity error */
#define A2B_ENUM_BECCTL_ENCRC_EN             (0x00000004u)  /*!<  CRC Error */
#define A2B_ENUM_BECCTL_ENCRC_DIS            (0x00000000u)  /*!<  No CRC Error */
#define A2B_ENUM_BECCTL_ENDD_EN              (0x00000002u)  /*!<  Enabled */
#define A2B_ENUM_BECCTL_ENDD_DIS             (0x00000000u)  /*!<  Disabled */
#define A2B_ENUM_BECCTL_ENHDCNT_EN           (0x00000001u)  /*!<  Enabled */
#define A2B_ENUM_BECCTL_ENHDCNT_DIS          (0x00000000u)  /*!<  Disabled */

#define A2B_REG_BECCTL_RESET                 (0x00000000u)  /*!<  Reset Value for BECCTL */
#define A2B_REG_BECNT_RESET                  (0x00000000u)  /*!<  Reset Value for BECNT */
#define A2B_REG_RAISE_RESET                  (0x00000000u)  /*!<  Reset Value for RAISE */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GENERR                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GENERR_GENICRCERR           (4u)           /*!<  Generate Int Frame CRC Error (Slave Only) */
#define A2B_BITP_GENERR_GENDPERR             (3u)           /*!<  Generate Data Parity Error */
#define A2B_BITP_GENERR_GENCRCERR            (2u)           /*!<  Generate CRC Error */
#define A2B_BITP_GENERR_GENDDERR             (1u)           /*!<  Generate Data Decoding Error */
#define A2B_BITP_GENERR_GENHCERR             (0u)           /*!<  Generate Header Count Error */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GENERR                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GENERR_GENICRCERR           (0x00000010u)
#define A2B_BITM_GENERR_GENDPERR             (0x00000008u)
#define A2B_BITM_GENERR_GENCRCERR            (0x00000004u)
#define A2B_BITM_GENERR_GENDDERR             (0x00000002u)
#define A2B_BITM_GENERR_GENHCERR             (0x00000001u)

#define A2B_REG_GENERR_RESET                 (0x00000000u)  /*!<  Reset Value for GENERR */
/* ============================================================================================================================ */
/** \name   PRBS Test Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        TESTMODE                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_TESTMODE_RXDPTH             (4u)           /*!<  RX Fifo Depth */
#define A2B_BITP_TESTMODE_PRBSN2N            (2u)           /*!<  PRBS N2N Mode */
#define A2B_BITP_TESTMODE_PRBSDN             (1u)           /*!<  PRBS Data Downstream */
#define A2B_BITP_TESTMODE_PRBSUP             (0u)           /*!<  PRBS Data Upstream */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        TESTMODE                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_TESTMODE_RXDPTH             (0x00000070u)
#define A2B_BITM_TESTMODE_PRBSN2N            (0x00000004u)
#define A2B_BITM_TESTMODE_PRBSDN             (0x00000002u)
#define A2B_BITM_TESTMODE_PRBSUP             (0x00000001u)

#define A2B_REG_TESTMODE_RESET               (0x00000000u)  /*!<  Reset Value for TESTMODE */
#define A2B_REG_ERRCNT0_RESET                (0x00000000u)  /*!<  Reset Value for ERRCNT0 */
#define A2B_REG_ERRCNT1_RESET                (0x00000000u)  /*!<  Reset Value for ERRCNT1 */
#define A2B_REG_ERRCNT2_RESET                (0x00000000u)  /*!<  Reset Value for ERRCNT2 */
#define A2B_REG_ERRCNT3_RESET                (0x00000000u)  /*!<  Reset Value for ERRCNT3 */
#define A2B_REG_SEED0_RESET                  (0x00000079u)  /*!<  Reset Value for SEED0 */
#define A2B_REG_SEED1_RESET                  (0x00000000u)  /*!<  Reset Value for SEED1 */
#define A2B_REG_SEED2_RESET                  (0x00000000u)  /*!<  Reset Value for SEED2 */
#define A2B_REG_SEED3_RESET                  (0x00000000u)  /*!<  Reset Value for SEED3 */
/* ============================================================================================================================ */
/** \name   Pin IO and Interrupt Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKCFG                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CLKCFG_CCLKREXT             (4u)           /*!<  Output Clock Rate Extension (Master Only) */
#define A2B_BITP_CLKCFG_CCLKRATE             (1u)           /*!<  Output Clock Rate */
#define A2B_BITP_CLKCFG_CCLKEN               (0u)           /*!<  Enable Output Clock */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKCFG                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_CLKCFG_CCLKREXT             (0x00000070u)
#define A2B_BITM_CLKCFG_CCLKRATE             (0x00000002u)
#define A2B_BITM_CLKCFG_CCLKEN               (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        CLKCFG                               Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_CLKCFG_CLKOUT_DIV512        (0x00000060u)  /*!<  CLKOUT = pllclk/512 */
#define A2B_ENUM_CLKCFG_CLKOUT_DIV128        (0x00000040u)  /*!<  CLKOUT = pllclk/128 */
#define A2B_ENUM_CLKCFG_CLKOUT_DIV16         (0x00000010u)  /*!<  CLKOUT = pllclk/16 */
#define A2B_ENUM_CLKCFG_CLKOUT_DIV64         (0x00000030u)  /*!<  CLKOUT = pllclk/64 */
#define A2B_ENUM_CLKCFG_USE_CCLKRATE         (0x00000000u)  /*!<  Use CCLKRATE */
#define A2B_ENUM_CLKCFG_CLKOUT_DIV1024       (0x00000070u)  /*!<  CLKOUT = pllclk/1024 */
#define A2B_ENUM_CLKCFG_CLKOUT_DIV32         (0x00000020u)  /*!<  CLKOUT = pllclk/32 */
#define A2B_ENUM_CLKCFG_CLKOUT_DIV256        (0x00000050u)  /*!<  CLKOUT = pllclk/256 */

#define A2B_REG_CLKCFG_RESET                 (0x00000000u)             /*      Reset Value for CLKCFG */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODAT                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIODAT_IO7DAT              (7u)           /*!<  IO7 Output Data - AD242X only */
#define A2B_BITP_GPIODAT_IO6DAT              (6u)           /*!<  IO6 Output Data */
#define A2B_BITP_GPIODAT_IO5DAT              (5u)           /*!<  IO5 Output Data */
#define A2B_BITP_GPIODAT_IO4DAT              (4u)           /*!<  IO4 Output Data */
#define A2B_BITP_GPIODAT_IO3DAT              (3u)           /*!<  IO3 Output Data */
#define A2B_BITP_GPIODAT_IO2DAT              (2u)           /*!<  IO2 Output Data */
#define A2B_BITP_GPIODAT_IO1DAT              (1u)           /*!<  IO1 Output Data */
#define A2B_BITP_GPIODAT_IO0DAT              (0u)           /*!<  IO0 Output Data */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODAT                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIODAT_IO7DAT              (0x00000080u)  /*!< AD242X only */
#define A2B_BITM_GPIODAT_IO6DAT              (0x00000040u)
#define A2B_BITM_GPIODAT_IO5DAT              (0x00000020u)
#define A2B_BITM_GPIODAT_IO4DAT              (0x00000010u)
#define A2B_BITM_GPIODAT_IO3DAT              (0x00000008u)
#define A2B_BITM_GPIODAT_IO2DAT              (0x00000004u)
#define A2B_BITM_GPIODAT_IO1DAT              (0x00000002u)
#define A2B_BITM_GPIODAT_IO0DAT              (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODAT                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_GPIODAT_IO7_HIGH            (0x00000080u)  /*!<  Output High - AD242X only */
#define A2B_ENUM_GPIODAT_IO7_LOW             (0x00000000u)  /*!<  Output Low - AD242X only */
#define A2B_ENUM_GPIODAT_IO6_HIGH            (0x00000040u)  /*!<  Output High */
#define A2B_ENUM_GPIODAT_IO6_LOW             (0x00000000u)  /*!<  Output Low */
#define A2B_ENUM_GPIODAT_IO5_HIGH            (0x00000020u)  /*!<  Output High */
#define A2B_ENUM_GPIODAT_IO5_LOW             (0x00000000u)  /*!<  Output Low */
#define A2B_ENUM_GPIODAT_IO4_HIGH            (0x00000010u)  /*!<  Output High */
#define A2B_ENUM_GPIODAT_IO4_LOW             (0x00000000u)  /*!<  Output Low */
#define A2B_ENUM_GPIODAT_IO3_HIGH            (0x00000008u)  /*!<  Output High */
#define A2B_ENUM_GPIODAT_IO3_LOW             (0x00000000u)  /*!<  Output Low */
#define A2B_ENUM_GPIODAT_IO2_HIGH            (0x00000004u)  /*!<  Output High */
#define A2B_ENUM_GPIODAT_IO2_LOW             (0x00000000u)  /*!<  Output Low */
#define A2B_ENUM_GPIODAT_IO1_HIGH            (0x00000002u)  /*!<  Output High */
#define A2B_ENUM_GPIODAT_IO1_LOW             (0x00000000u)  /*!<  Output Low */
#define A2B_ENUM_GPIODAT_IO0_HIGH            (0x00000001u)  /*!<  Output High */
#define A2B_ENUM_GPIODAT_IO0_LOW             (0x00000000u)  /*!<  Output Low */

