Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
#define A2B_REG_GPIODAT_RESET                (0x00000000u)  /*!<  Reset Value for GPIODAT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODATSET                           Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIODATSET_IO7DSET          (7u)           /*!<  Write 1 to set IO7DAT - AD242X only */
#define A2B_BITP_GPIODATSET_IO6DSET          (6u)           /*!<  Write 1 to set IO6DAT */
#define A2B_BITP_GPIODATSET_IO5DSET          (5u)           /*!<  Write 1 to set IO5DAT */
#define A2B_BITP_GPIODATSET_IO4DSET          (4u)           /*!<  Write 1 to set IO4DAT */
#define A2B_BITP_GPIODATSET_IO3DSET          (3u)           /*!<  Write 1 to set IO3DAT */
#define A2B_BITP_GPIODATSET_IO2DSET          (2u)           /*!<  Write 1 to set IO2DAT */
#define A2B_BITP_GPIODATSET_IO1DSET          (1u)           /*!<  Write 1 to set IO1DAT */
#define A2B_BITP_GPIODATSET_IO0DSET          (0u)           /*!<  Write 1 to set IO0DAT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODATSET                           Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIODATSET_IO7DSET          (0x00000080u)  /*!< AD242X only */
#define A2B_BITM_GPIODATSET_IO6DSET          (0x00000040u)
#define A2B_BITM_GPIODATSET_IO5DSET          (0x00000020u)
#define A2B_BITM_GPIODATSET_IO4DSET          (0x00000010u)
#define A2B_BITM_GPIODATSET_IO3DSET          (0x00000008u)
#define A2B_BITM_GPIODATSET_IO2DSET          (0x00000004u)
#define A2B_BITM_GPIODATSET_IO1DSET          (0x00000002u)
#define A2B_BITM_GPIODATSET_IO0DSET          (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODATSET                           Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_GPIODATSET_IO7_SET          (0x00000080u)  /*!<  Set Bit - AD242X only */
#define A2B_ENUM_GPIODATSET_IO7_NO_ACTION    (0x00000000u)  /*!<  No Action - AD242X only */
#define A2B_ENUM_GPIODATSET_IO6_SET          (0x00000040u)  /*!<  Set Bit */
#define A2B_ENUM_GPIODATSET_IO6_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATSET_IO5_SET          (0x00000020u)  /*!<  Set Bit */
#define A2B_ENUM_GPIODATSET_IO5_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATSET_IO4_SET          (0x00000010u)  /*!<  Set Bit */
#define A2B_ENUM_GPIODATSET_IO4_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATSET_IO3_SET          (0x00000008u)  /*!<  Set Bit */
#define A2B_ENUM_GPIODATSET_IO3_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATSET_IO2_SET          (0x00000004u)  /*!<  Set Bit */
#define A2B_ENUM_GPIODATSET_IO2_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATSET_IO1_SET          (0x00000002u)  /*!<  Set Bit */
#define A2B_ENUM_GPIODATSET_IO1_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATSET_IO0_SET          (0x00000001u)  /*!<  Set Bit */
#define A2B_ENUM_GPIODATSET_IO0_NO_ACTION    (0x00000000u)  /*!<  No Action */

#define A2B_REG_GPIODATSET_RESET             (0x00000000u)  /*!<  Reset Value for GPIODATSET */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODATCLR                           Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIODATCLR_IO7DCLR          (7u)           /*!<  Write 1 to clear IO7DAT - AD242X only */
#define A2B_BITP_GPIODATCLR_IO6DCLR          (6u)           /*!<  Write 1 to clear IO6DAT */
#define A2B_BITP_GPIODATCLR_IO5DCLR          (5u)           /*!<  Write 1 to clear IO5DAT */
#define A2B_BITP_GPIODATCLR_IO4DCLR          (4u)           /*!<  Write 1 to clear IO4DAT */
#define A2B_BITP_GPIODATCLR_IO3DCLR          (3u)           /*!<  Write 1 to clear IO3DAT */
#define A2B_BITP_GPIODATCLR_IO2DCLR          (2u)           /*!<  Write 1 to clear IO2DAT */
#define A2B_BITP_GPIODATCLR_IO1DCLR          (1u)           /*!<  Write 1 to clear IO1DAT */
#define A2B_BITP_GPIODATCLR_IO0DCLR          (0u)           /*!<  Write 1 to clear IO0DAT */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODATCLR                           Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIODATCLR_IO7DCLR          (0x00000080u)  /*!< AD242X only */
#define A2B_BITM_GPIODATCLR_IO6DCLR          (0x00000040u)
#define A2B_BITM_GPIODATCLR_IO5DCLR          (0x00000020u)
#define A2B_BITM_GPIODATCLR_IO4DCLR          (0x00000010u)
#define A2B_BITM_GPIODATCLR_IO3DCLR          (0x00000008u)
#define A2B_BITM_GPIODATCLR_IO2DCLR          (0x00000004u)
#define A2B_BITM_GPIODATCLR_IO1DCLR          (0x00000002u)
#define A2B_BITM_GPIODATCLR_IO0DCLR          (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIODATCLR                           Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_GPIODATCLR_IO7_CLEAR        (0x00000080u)  /*!<  Clear Bit - AD242X only */
#define A2B_ENUM_GPIODATCLR_IO7_NO_ACTION    (0x00000000u)  /*!<  No Action - AD242X only */
#define A2B_ENUM_GPIODATCLR_IO6_CLEAR        (0x00000040u)  /*!<  Clear Bit */
#define A2B_ENUM_GPIODATCLR_IO6_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATCLR_IO5_CLEAR        (0x00000020u)  /*!<  Clear Bit */
#define A2B_ENUM_GPIODATCLR_IO5_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATCLR_IO4_CLEAR        (0x00000010u)  /*!<  Clear Bit */
#define A2B_ENUM_GPIODATCLR_IO4_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATCLR_IO3_CLEAR        (0x00000008u)  /*!<  Clear Bit */
#define A2B_ENUM_GPIODATCLR_IO3_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATCLR_IO2_CLEAR        (0x00000004u)  /*!<  Clear Bit */
#define A2B_ENUM_GPIODATCLR_IO2_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATCLR_IO1_CLEAR        (0x00000002u)  /*!<  Clear Bit */
#define A2B_ENUM_GPIODATCLR_IO1_NO_ACTION    (0x00000000u)  /*!<  No Action */
#define A2B_ENUM_GPIODATCLR_IO0_CLEAR        (0x00000001u)  /*!<  Clear Bit */
#define A2B_ENUM_GPIODATCLR_IO0_NO_ACTION    (0x00000000u)  /*!<  No Action */

#define A2B_REG_GPIODATCLR_RESET             (0x00000000u)  /*!<  Reset Value for GPIODATCLR */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOOEN                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOOEN_IO7OEN              (7u)           /*!<  IO7 Output Enable - AD242X only */
#define A2B_BITP_GPIOOEN_IO6OEN              (6u)           /*!<  IO6 Output Enable */
#define A2B_BITP_GPIOOEN_IO5OEN              (5u)           /*!<  IO5 Output Enable */
#define A2B_BITP_GPIOOEN_IO4OEN              (4u)           /*!<  IO4 Output Enable */
#define A2B_BITP_GPIOOEN_IO3OEN              (3u)           /*!<  IO3 Output Enable */
#define A2B_BITP_GPIOOEN_IO2OEN              (2u)           /*!<  IO2 Output Enable */
#define A2B_BITP_GPIOOEN_IO1OEN              (1u)           /*!<  IO1 Output Enable */
#define A2B_BITP_GPIOOEN_IO0OEN              (0u)           /*!<  IO0 Output Enable */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOOEN                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOOEN_IO7OEN              (0x00000080u)  /*!< AD242X only */
#define A2B_BITM_GPIOOEN_IO6OEN              (0x00000040u)
#define A2B_BITM_GPIOOEN_IO5OEN              (0x00000020u)
#define A2B_BITM_GPIOOEN_IO4OEN              (0x00000010u)
#define A2B_BITM_GPIOOEN_IO3OEN              (0x00000008u)
#define A2B_BITM_GPIOOEN_IO2OEN              (0x00000004u)
#define A2B_BITM_GPIOOEN_IO1OEN              (0x00000002u)
#define A2B_BITM_GPIOOEN_IO0OEN              (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOOEN                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_GPIOOEN_IO7_EN              (0x00000080u)  /*!<  Enable - AD242X only */
#define A2B_ENUM_GPIOOEN_IO7_DIS             (0x00000000u)  /*!<  Disable - AD242X only */
#define A2B_ENUM_GPIOOEN_IO6_EN              (0x00000040u)  /*!<  Enable */
#define A2B_ENUM_GPIOOEN_IO6_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOOEN_IO5_EN              (0x00000020u)  /*!<  Enable */
#define A2B_ENUM_GPIOOEN_IO5_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOOEN_IO4_EN              (0x00000010u)  /*!<  Enable */
#define A2B_ENUM_GPIOOEN_IO4_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOOEN_IO3_EN              (0x00000008u)  /*!<  Enable */
#define A2B_ENUM_GPIOOEN_IO3_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOOEN_IO2_EN              (0x00000004u)  /*!<  Enable */
#define A2B_ENUM_GPIOOEN_IO2_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOOEN_IO1_EN              (0x00000002u)  /*!<  Enable */
#define A2B_ENUM_GPIOOEN_IO1_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOOEN_IO0_EN              (0x00000001u)  /*!<  Enable */
#define A2B_ENUM_GPIOOEN_IO0_DIS             (0x00000000u)  /*!<  Disable */

#define A2B_REG_GPIOOEN_RESET                (0x00000000u)  /*!<  Reset Value for GPIOOEN */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOIEN                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOIEN_IO7IEN              (7u)           /*!<  IO7 Input Enable - AD242X only */
#define A2B_BITP_GPIOIEN_IO6IEN              (6u)           /*!<  IO6 Input Enable */
#define A2B_BITP_GPIOIEN_IO5IEN              (5u)           /*!<  IO5 Input Enable */
#define A2B_BITP_GPIOIEN_IO4IEN              (4u)           /*!<  IO4 Input Enable */
#define A2B_BITP_GPIOIEN_IO3IEN              (3u)           /*!<  IO3 Input Enable */
#define A2B_BITP_GPIOIEN_IO2IEN              (2u)           /*!<  IO2 Input Enable */
#define A2B_BITP_GPIOIEN_IO1IEN              (1u)           /*!<  IO1 Input Enable */
#define A2B_BITP_GPIOIEN_IO0IEN              (0u)           /*!<  IO0 Input Enable */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOIEN                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOIEN_IO7IEN              (0x00000080u)  /*!< AD242X only */
#define A2B_BITM_GPIOIEN_IO6IEN              (0x00000040u)
#define A2B_BITM_GPIOIEN_IO5IEN              (0x00000020u)
#define A2B_BITM_GPIOIEN_IO4IEN              (0x00000010u)
#define A2B_BITM_GPIOIEN_IO3IEN              (0x00000008u)
#define A2B_BITM_GPIOIEN_IO2IEN              (0x00000004u)
#define A2B_BITM_GPIOIEN_IO1IEN              (0x00000002u)
#define A2B_BITM_GPIOIEN_IO0IEN              (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOIEN                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_GPIOIEN_IO7_EN              (0x00000080u)  /*!<  Enable - AD242X only */
#define A2B_ENUM_GPIOIEN_IO7_DIS             (0x00000000u)  /*!<  Disable - AD242X only */
#define A2B_ENUM_GPIOIEN_IO6_EN              (0x00000040u)  /*!<  Enable */
#define A2B_ENUM_GPIOIEN_IO6_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOIEN_IO5_EN              (0x00000020u)  /*!<  Enable */
#define A2B_ENUM_GPIOIEN_IO5_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOIEN_IO4_EN              (0x00000010u)  /*!<  Enable */
#define A2B_ENUM_GPIOIEN_IO4_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOIEN_IO3_EN              (0x00000008u)  /*!<  Enable */
#define A2B_ENUM_GPIOIEN_IO3_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOIEN_IO2_EN              (0x00000004u)  /*!<  Enable */
#define A2B_ENUM_GPIOIEN_IO2_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOIEN_IO1_EN              (0x00000002u)  /*!<  Enable */
#define A2B_ENUM_GPIOIEN_IO1_DIS             (0x00000000u)  /*!<  Disable */
#define A2B_ENUM_GPIOIEN_IO0_EN              (0x00000001u)  /*!<  Enable */
#define A2B_ENUM_GPIOIEN_IO0_DIS             (0x00000000u)  /*!<  Disable */

#define A2B_REG_GPIOIEN_RESET                (0x00000000u)  /*!<  Reset Value for GPIOIEN */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOIN                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_GPIOIN_IO7IN                (7u)           /*!<  IO7 Input Value - AD242X only */
#define A2B_BITP_GPIOIN_IO6IN                (6u)           /*!<  IO6 Input Value */
#define A2B_BITP_GPIOIN_IO5IN                (5u)           /*!<  IO5 Input Value */
#define A2B_BITP_GPIOIN_IO4IN                (4u)           /*!<  IO4 Input Value */
#define A2B_BITP_GPIOIN_IO3IN                (3u)           /*!<  IO3 Input Value */
#define A2B_BITP_GPIOIN_IO2IN                (2u)           /*!<  IO2 Input Value */
#define A2B_BITP_GPIOIN_IO1IN                (1u)           /*!<  IO1 Input Value */
#define A2B_BITP_GPIOIN_IO0IN                (0u)           /*!<  IO0 Input Value */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        GPIOIN                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_GPIOIN_IO7IN                (0x00000080u)  /*!< AD242X only */
#define A2B_BITM_GPIOIN_IO6IN                (0x00000040u)
#define A2B_BITM_GPIOIN_IO5IN                (0x00000020u)
#define A2B_BITM_GPIOIN_IO4IN                (0x00000010u)
#define A2B_BITM_GPIOIN_IO3IN                (0x00000008u)
#define A2B_BITM_GPIOIN_IO2IN                (0x00000004u)
#define A2B_BITM_GPIOIN_IO1IN                (0x00000002u)
#define A2B_BITM_GPIOIN_IO0IN                (0x00000001u)

