Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
#define A2B_REG_GPIOIN_RESET                 (0x00000000u)  /*!<  Reset Value for GPIOIN */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PINTEN                               Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_PINTEN_IO7IE                (7u)           /*!<  IO7 Interrupt Request Capability Enable - AD242X only */
#define A2B_BITP_PINTEN_IO6IE                (6u)           /*!<  DRX1/IO6 Interrupt Request Capability Enable */
#define A2B_BITP_PINTEN_IO5IE                (5u)           /*!<  DRX0/IO5 Interrupt Request Capability Enable */
#define A2B_BITP_PINTEN_IO4IE                (4u)           /*!<  DTX1/IO4 Interrupt Request Capability Enable */
#define A2B_BITP_PINTEN_IO3IE                (3u)           /*!<  DTX0/IO3 Interrupt Request Capability Enable */
#define A2B_BITP_PINTEN_IO2IE                (2u)           /*!<  ADR2/IO2 Interrupt Request Capability Enable */
#define A2B_BITP_PINTEN_IO1IE                (1u)           /*!<  ADR1/IO1 Interrupt Request Capability Enable */
#define A2B_BITP_PINTEN_IO0IE                (0u)           /*!<  IRQ/IO0 Interrupt Request Capability Enable */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PINTEN                               Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_PINTEN_IO7IE                (0x00000080u)  /*!< AD242X only */
#define A2B_BITM_PINTEN_IO6IE                (0x00000040u)
#define A2B_BITM_PINTEN_IO5IE                (0x00000020u)
#define A2B_BITM_PINTEN_IO4IE                (0x00000010u)
#define A2B_BITM_PINTEN_IO3IE                (0x00000008u)
#define A2B_BITM_PINTEN_IO2IE                (0x00000004u)
#define A2B_BITM_PINTEN_IO1IE                (0x00000002u)
#define A2B_BITM_PINTEN_IO0IE                (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PINTEN                               Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_PINTEN_IO7_EN               (0x00000080u)  /*!<  Enable Interrupt Request Capability - AD242X only */
#define A2B_ENUM_PINTEN_IO7_DIS              (0x00000000u)  /*!<  Disable Interrupt Request Capability - AD242X only */
#define A2B_ENUM_PINTEN_IO6_EN               (0x00000040u)  /*!<  Enable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO6_DIS              (0x00000000u)  /*!<  Disable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO5_EN               (0x00000020u)  /*!<  Enable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO5_DIS              (0x00000000u)  /*!<  Disable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO4_EN               (0x00000010u)  /*!<  Enable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO4_DIS              (0x00000000u)  /*!<  Disable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO3_EN               (0x00000008u)  /*!<  Enable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO3_DIS              (0x00000000u)  /*!<  Disable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO2_EN               (0x00000004u)  /*!<  Enable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO2_DIS              (0x00000000u)  /*!<  Disable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO1_EN               (0x00000002u)  /*!<  Enable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO1_DIS              (0x00000000u)  /*!<  Disable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO0_EN               (0x00000001u)  /*!<  Enable Interrupt Request Capability */
#define A2B_ENUM_PINTEN_IO0_DIS              (0x00000000u)  /*!<  Disable Interrupt Request Capability */

#define A2B_REG_PINTEN_RESET                 (0x00000000u)  /*!<  Reset Value for PINTEN */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PINTINV                              Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_PINTINV_IO7INV              (7u)           /*!<  Invert IO7 - AD242X only */
#define A2B_BITP_PINTINV_IO6INV              (6u)           /*!<  Invert IO6 */
#define A2B_BITP_PINTINV_IO5INV              (5u)           /*!<  Invert IO5 */
#define A2B_BITP_PINTINV_IO4INV              (4u)           /*!<  Invert IO4 */
#define A2B_BITP_PINTINV_IO3INV              (3u)           /*!<  Invert IO3 */
#define A2B_BITP_PINTINV_IO2INV              (2u)           /*!<  Invert IO2 */
#define A2B_BITP_PINTINV_IO1INV              (1u)           /*!<  Invert IO1 */
#define A2B_BITP_PINTINV_IO0INV              (0u)           /*!<  Invert IO0 */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PINTINV                              Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_PINTINV_IO7INV              (0x00000080u)  /*!< AD242X only */
#define A2B_BITM_PINTINV_IO6INV              (0x00000040u)
#define A2B_BITM_PINTINV_IO5INV              (0x00000020u)
#define A2B_BITM_PINTINV_IO4INV              (0x00000010u)
#define A2B_BITM_PINTINV_IO3INV              (0x00000008u)
#define A2B_BITM_PINTINV_IO2INV              (0x00000004u)
#define A2B_BITM_PINTINV_IO1INV              (0x00000002u)
#define A2B_BITM_PINTINV_IO0INV              (0x00000001u)
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PINTINV                              Enumerations  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_ENUM_PINTINV_IO7_EN              (0x00000080u)  /*!<  Active Low (Falling Edge) - AD242X only */
#define A2B_ENUM_PINTINV_IO7_DIS             (0x00000000u)  /*!<  Disable Inverter - AD242X only */
#define A2B_ENUM_PINTINV_IO6_EN              (0x00000040u)  /*!<  Active Low (Falling Edge) */
#define A2B_ENUM_PINTINV_IO6_DIS             (0x00000000u)  /*!<  Disable Inverter */
#define A2B_ENUM_PINTINV_IO5_EN              (0x00000020u)  /*!<  Active Low (Falling Edge) */
#define A2B_ENUM_PINTINV_IO5_DIS             (0x00000000u)  /*!<  Active High (Rising Edge) */
#define A2B_ENUM_PINTINV_IO4_EN              (0x00000010u)  /*!<  Active Low (Falling Edge) */
#define A2B_ENUM_PINTINV_IO4_DIS             (0x00000000u)  /*!<  Active High (Rising Edge) */
#define A2B_ENUM_PINTINV_IO3_EN              (0x00000008u)  /*!<  Active Low (Falling Edge) */
#define A2B_ENUM_PINTINV_IO3_DIS             (0x00000000u)  /*!<  Active High (Rising Edge) */
#define A2B_ENUM_PINTINV_IO2_EN              (0x00000004u)  /*!<  Active Low (Falling Edge) */
#define A2B_ENUM_PINTINV_IO2_DIS             (0x00000000u)  /*!<  Active High (Rising Edge) */
#define A2B_ENUM_PINTINV_IO1_EN              (0x00000002u)  /*!<  Active Low (Falling Edge) */
#define A2B_ENUM_PINTINV_IO1_DIS             (0x00000000u)  /*!<  Active High (Rising Edge) */
#define A2B_ENUM_PINTINV_IO0_EN              (0x00000001u)  /*!<  Active Low (Falling Edge) */
#define A2B_ENUM_PINTINV_IO0_DIS             (0x00000000u)  /*!<  Active High (Rising Edge) */

#define A2B_REG_PINTINV_RESET                (0x00000000u)  /*!<  Reset Value for PINTINV */
/* ============================================================================================================================ */
/** \name   Shadow Register Committed Copy Read Access Register Field Definitions */
/* ============================================================================================================================ */
#define A2B_REG_RESPCCC_RESET                (0x00000040u)  /*!<  Reset Value for RESPCCC */
#define A2B_REG_DCTLCC_RESET                 (0x00000000u)  /*!<  Reset Value for DCTLCC */
#define A2B_REG_DNSCC_RESET                  (0x00000000u)  /*!<  Reset Value for DNSCC */
#define A2B_REG_LDNSCC_RESET                 (0x00000000u)  /*!<  Reset Value for LDNSCC */
#define A2B_REG_UPSCC_RESET                  (0x00000000u)  /*!<  Reset Value for UPSCC */
#define A2B_REG_LUPSCC_RESET                 (0x00000000u)  /*!<  Reset Value for LUPSCC */
#define A2B_REG_BCDNSCC_RESET                (0x00000000u)  /*!<  Reset Value for BCDNSCC */
#define A2B_REG_SFMTCC_RESET                 (0x00000000u)  /*!<  Reset Value for SFMTCC */
/* ============================================================================================================================ */
/** \name   Chip test Register Field Definitions */
/* ============================================================================================================================ */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PTSTMODE                             Pos               Description */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_PTSTMODE_SWTHRSHLD          (5u)           /*!<  Switch Threshold Signal */
#define A2B_BITP_PTSTMODE_IGNSWFIN           (4u)           /*!<  Ignore Switch Finished Signal */
#define A2B_BITP_PTSTMODE_DISECC             (3u)           /*!<  Disable ECC in eFuse */
#define A2B_BITP_PTSTMODE_LDTRIMVAL          (2u)           /*!<  Load Trim Value into eFuse */
#define A2B_BITP_PTSTMODE_CRCDIS             (1u)           /*!<  CRC Disable */
#define A2B_BITP_PTSTMODE_VREGDIS            (0u)           /*!<  Voltage Regulator Disable */
/* ------------------------------------------------------------------------------------------------------------------------- */
/*        PTSTMODE                             Masks  */
/* ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITM_PTSTMODE_SWTHRSHLD          (0x00000020u)
#define A2B_BITM_PTSTMODE_IGNSWFIN           (0x00000010u)
#define A2B_BITM_PTSTMODE_DISECC             (0x00000008u)
#define A2B_BITM_PTSTMODE_LDTRIMVAL          (0x00000004u)
#define A2B_BITM_PTSTMODE_CRCDIS             (0x00000002u)
#define A2B_BITM_PTSTMODE_VREGDIS            (0x00000001u)

