Xyzarcus/A2B_Cube/STM32CubeIDE/Application/a2buser/regdefs.h
#define A2B_REG_PTSTMODE_RESET               (0x00000000u)  /*!<  Reset Value for PTSTMODE */
#define A2B_REG_STRAPVAL_RESET               (0x00000000u)  /*!<  Reset Value for STRAPVAL */
/* ============================================================================================================================ */
/*    Trigger Master Definitions */
/* ============================================================================================================================ */

/* ============================================================================================================================ */
/*    Trigger Slave Definitions */
/* ============================================================================================================================ */

/** \} -- needed for last name */
/** \} -- a2bstack_regdefs_masks */

/* ============================================================================================================================ */
/** \name   CHIRON Register Field Definitions */
/* ============================================================================================================================ */

#define A2B_REG_PDMCTL2_RESET                (0x00000000u)            /*  Reset Value for PDMCTL2  */
#define A2B_REG_PDMCTL2                      (0x0000005Du)            /*  A2B PDM Control 2 Register */
#define A2B_REG_CHIPID0_RESET                (0x00000000u)            /*  Reset Value for CHIPID0  */
#define A2B_REG_CHIPID0                      (0x0000006Au)            /*  A2B Chip ID Register 0 */
#define A2B_REG_CHIPID1_RESET                (0x00000000u)            /*  Reset Value for CHIPID1  */
#define A2B_REG_CHIPID1                      (0x0000006Bu)            /*  A2B Chip ID Register 1 */
#define A2B_REG_CHIPID2_RESET                (0x00000000u)            /*  Reset Value for CHIPID2  */
#define A2B_REG_CHIPID2                      (0x0000006Cu)            /*  A2B Chip ID Register 2 */
#define A2B_REG_CHIPID3_RESET                (0x00000000u)            /*  Reset Value for CHIPID3  */
#define A2B_REG_CHIPID3                      (0x0000006Du)            /*  A2B Chip ID Register 3 */
#define A2B_REG_CHIPID4_RESET                (0x00000000u)            /*  Reset Value for CHIPID4  */
#define A2B_REG_CHIPID4                      (0x0000006Eu)            /*  A2B Chip ID Register 4 */
#define A2B_REG_CHIPID5_RESET                (0x00000000u)            /*  Reset Value for CHIPID5  */
#define A2B_REG_CHIPID5                      (0x0000006Fu)            /*  A2B Chip ID Register 5 */

/* -------------------------------------------------------------------------------------------------------------------------
          A2B_PDMCTL2                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_PDMCTL2_PDMINVCLK            5u            /*  PDM Inverted Version of Alternate Clock */
#define A2B_BITP_PDMCTL2_PDMALTCLK            4u            /*  PDM Alternate Clock */
#define A2B_BITP_PDMCTL2_PDM1FFRST            3u            /*  PDM1 Falling Edge First Enable */
#define A2B_BITP_PDMCTL2_PDM0FFRST            2u            /*  PDM0 Falling Edge First Enable */
#define A2B_BITP_PDMCTL2_PDMDEST              0u            /*  PDM Destination */
#define A2B_BITM_PDMCTL2_PDMINVCLK           (_ADI_MSK_3(0x00000020,0x00000020U, uint8_t   ))    /*  PDM Inverted Version of Alternate Clock */
#define A2B_BITM_PDMCTL2_PDMALTCLK           (_ADI_MSK_3(0x00000010,0x00000010U, uint8_t   ))    /*  PDM Alternate Clock */
#define A2B_BITM_PDMCTL2_PDM1FFRST           (_ADI_MSK_3(0x00000008,0x00000008U, uint8_t   ))    /*  PDM1 Falling Edge First Enable */
#define A2B_BITM_PDMCTL2_PDM0FFRST           (_ADI_MSK_3(0x00000004,0x00000004U, uint8_t   ))    /*  PDM0 Falling Edge First Enable */
#define A2B_BITM_PDMCTL2_PDMDEST             (_ADI_MSK_3(0x00000003,0x00000003U, uint8_t   ))    /*  PDM Destination */

/* -------------------------------------------------------------------------------------------------------------------------
          A2B_CHIPID0                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CHIPID0_CHIPID               0            /*  Contains 48-bit Unique Chip ID Value */
#define A2B_BITM_CHIPID0_CHIPID              (_ADI_MSK_3(0x000000FF,0x000000FFU, uint8_t   ))    /*  Contains 48-bit Unique Chip ID Value */

/* -------------------------------------------------------------------------------------------------------------------------
          A2B_CHIPID1                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CHIPID1_CHIPID               0            /*  Contains 48-bit Unique Chip ID Value */
#define A2B_BITM_CHIPID1_CHIPID              (_ADI_MSK_3(0x000000FF,0x000000FFU, uint8_t   ))    /*  Contains 48-bit Unique Chip ID Value */

/* -------------------------------------------------------------------------------------------------------------------------
          A2B_CHIPID2                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CHIPID2_CHIPID               0            /*  Contains 48-bit Unique Chip ID Value */
#define A2B_BITM_CHIPID2_CHIPID              (_ADI_MSK_3(0x000000FF,0x000000FFU, uint8_t   ))    /*  Contains 48-bit Unique Chip ID Value */

/* -------------------------------------------------------------------------------------------------------------------------
          A2B_CHIPID3                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CHIPID3_CHIPID               0            /*  Contains 48-bit Unique Chip ID Value */
#define A2B_BITM_CHIPID3_CHIPID              (_ADI_MSK_3(0x000000FF,0x000000FFU, uint8_t   ))    /*  Contains 48-bit Unique Chip ID Value */

/* -------------------------------------------------------------------------------------------------------------------------
          A2B_CHIPID4                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CHIPID4_CHIPID               0            /*  Contains 48-bit Unique Chip ID Value */
#define A2B_BITM_CHIPID4_CHIPID              (_ADI_MSK_3(0x000000FF,0x000000FFU, uint8_t   ))    /*  Contains 48-bit Unique Chip ID Value */

/* -------------------------------------------------------------------------------------------------------------------------
          A2B_CHIPID5                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define A2B_BITP_CHIPID5_CHIPID               0            /*  Contains 48-bit Unique Chip ID Value */
#define A2B_BITM_CHIPID5_CHIPID              (_ADI_MSK_3(0x000000FF,0x000000FFU, uint8_t   ))    /*  Contains 48-bit Unique Chip ID Value */

/*======================= D A T A T Y P E S =======================*/



/*======================= P U B L I C  P R O T O T Y P E S ========*/




/*======================= D A T A =================================*/

/** \} -- a2bstack_regdefs */

#endif /* A2B_REGDEFS_H_ */
